[{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b733"
  },
  "recipeName": "Blackberry Fool",
  "recipeType": "Dessert",
  "recipeArea": "British",
  "ingredients": [
    "50g Hazlenuts",
    "125g Butter",
    "150g Caster Sugar",
    "Grated Lemon",
    "150g Plain Flour",
    "½ tsp Baking Powder",
    "600g Blackberrys",
    "75g Sugar",
    "2 tbs Caster Sugar",
    "1 tbs Lemon Juice",
    "300ml  Double Cream",
    "100ml Yogurt",
    "Garnish with Mint"
  ],
  "instructions": [
    "For the biscuits, preheat the oven to 200C/180C (fan)/Gas 6 and line two large baking trays with baking parchment. Scatter the nuts over a baking tray and roast in the oven for 6-8 minutes, or until golden-brown. Watch them carefully so that they don’t have a chance to burn. Remove from the oven, tip onto a board and leave to cool.",
    "Put the butter and sugar in a large bowl and beat with a wooden spoon until light and creamy. Roughly chop the cooled nuts and add to the creamed butter and sugar, along with the lemon zest, flour and baking powder. Stir well until the mixture comes together and forms a ball – you may need to use your hands.",
    "Divide the biscuit dough into 24 even pieces and roll into small balls. Place the balls the prepared baking trays, spaced well apart to allow for spreading.",
    "Press the biscuits to flatten to around 1cm/½in thick. Bake the biscuits, one tray at a time, for 12 minutes or until very pale golden-brown. Leave to cool on the trays. They will be very soft when you take them out of the oven, but will crisp as they cool.",
    "Store in an airtight tin and eat within five days.",
    "For the fool, rinse the blackberries in a colander to wash away any dust or dirt. Put the blackberries in a non-stick saucepan and sprinkle over the caster sugar.",
    "Stir in the lemon juice and heat gently for two minutes, or until the blackberries begin to soften and release their juices. Remove and reserve 12 blackberries for decoration and continue cooking the rest.",
    "Simmer the blackberries very gently for 15 minutes, stirring regularly until very soft and squidgy. Remove from the heat and press the berries and juice through a sieve over a bowl, using the bottom of a ladle to help you extract as much of the purée as possible. Leave the purée to cool and discard the seeds. You should end up with around 325ml/11fl oz of purée.",
    "Put the cream and yoghurt in a large bowl and whip with an electric whisk until soft peaks form when the whisk is removed from the bowl – the acidity of the fruit will thicken the cream further, so don’t take it too far.",
    "When the purée is completely cold, adjust the sweetness to taste by adding more sugar if needed. Pour it into the bowl with the whipped cream and yoghurt and stir just once or twice until very lightly combined.",
    "Spoon the blackberry fool into individual wide, glass dishes – or one large, single bowl. It should look quite marbled, so don’t over-stir it. Scatter a few tiny mint leaves on top and decorate with the reserved blackberries. Sprinkle with a little sugar if you like and serve with the hazelnut biscuits."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/rpvptu1511641092.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b734"
  },
  "recipeName": "Budino Di Ricotta",
  "recipeType": "Dessert",
  "recipeArea": "Italian",
  "ingredients": [
    "500g Ricotta",
    "4 large Eggs",
    "3 tbs Flour",
    "250g Sugar",
    "1 tsp  Cinnamon",
    "Grated Zest of 2 Lemons",
    "5 tbs Dark Rum",
    "sprinking Icing Sugar"
  ],
  "instructions": [
    "Mash the ricotta and beat well with the egg yolks, stir in the flour, sugar, cinnamon, grated lemon rind and the rum and mix well. You can do this in a food processor. Beat the egg whites until stiff, fold in and pour into a buttered and floured 25cm cake tin. Bake in the oven at 180ºC/160ºC fan/gas 4 for about 40 minutes, or until it is firm.",
    "Serve hot or cold dusted with icing sugar."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1549542877.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b735"
  },
  "recipeName": "Eccles Cakes",
  "recipeType": "Dessert",
  "recipeArea": "British",
  "ingredients": [
    "250g Butter",
    "350g Plain Flour",
    "Juice of 1/2 Lemon",
    "25g Butter",
    "200g Currants",
    "50g Mixed Peel",
    "100g  Muscovado Sugar",
    "1 tsp  Cinnamon",
    "1 tsp  Ginger",
    "1 tsp  Allspice",
    "Zest of 1 Lemon",
    "1 beaten Eggs",
    "spinkling Sugar"
  ],
  "instructions": [
    "To make the pastry, dice the butter and put it in the freezer to go really hard. Tip flour into the bowl of a food processor with half the butter and pulse to the texture of breadcrumbs. Pour in the lemon juice and 100ml iced water, and pulse to a dough. Tip in the rest of the butter and pulse a few times until the dough is heavily flecked with butter. It is important that you don’t overdo this as the flecks of butter are what makes the pastry flaky.",
    "On a floured surface roll the pastry out to a neat rectangle about 20 x 30cm. Fold the two ends of the pastry into the middle (See picture 1), then fold in half (pic 2). Roll the pastry out again and refold the same way 3 more times resting the pastry for at least 15 mins each time between roll and fold, then leave to rest in the fridge for at least 30 mins before using.",
    "To make the filling, melt the butter in a large saucepan. Take it off the heat and stir in all the other ingredients until completely mixed, then set aside.",
    "To make the cakes, roll the pastry out until it’s just a little thicker than a £1 coin and cut out 8 rounds about 12cm across. Re-roll the trimming if needed. Place a good heaped tablespoon of mixture in the middle of each round, brush the edges of the rounds with water, then gather the pastry around the filling and squeeze it together (pic 3). Flip them over so the smooth top is upwards and pat them into a smooth round. Flatten each round with a rolling pin to an oval until the fruit just starts to poke through, then place on a baking tray. Cut 2 little slits in each Eccles cakes, brush generously with egg white and sprinkle with the sugar (pic 4).",
    "Heat the oven to 220C/200C fan/gas 8. Bake the Eccles cakes for 15-20 mins until just past golden brown and sticky. Leave to cool on a rack and enjoy while still warm or cold with a cup of tea. If you prefer, Eccles cakes also go really well served with a wedge of hard, tangy British cheese such as Lancashire or cheddar."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/wtqrqw1511639627.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b736"
  },
  "recipeName": "Szechuan Beef",
  "recipeType": "Beef",
  "recipeArea": "Chinese",
  "ingredients": [
    "1/2 lb Beef",
    "1/2 tsp Salt",
    "1 tsp  Sesame Seed Oil",
    "1 pinch Pepper",
    "1 Egg White",
    "3 tbs Starch",
    "4 tbs Oil",
    "1 tsp  Ginger",
    "1 tsp  Garlic",
    "3/4 cup  Onion",
    "1/2 cup  Carrots",
    "3/4 cup  Green Pepper",
    "1 cup  Celery",
    "1 cup  Mushrooms",
    "1 tbs Cooking wine",
    "1 cup  Water",
    "1 tbs Oyster Sauce",
    "1/2 tsp Hotsauce",
    "1 tsp  Sugar",
    "1 tbs Soy Sauce"
  ],
  "instructions": [
    "- MARINATING THE BEEF",
    "In a bowl, add the beef, salt, sesame seed oil, white pepper, egg white, 2 Tablespoon of corn starch and 1 Tablespoon of oil.",
    "- STIR FRY",
    "First Cook the beef by adding 2 Tablespoon of oil until the beef is golden brown.",
    "Set the beef aside",
    "In a wok add 1 Tablespoon of oil, minced ginger, minced garlic and stir-fry for few seconds.",
    "Next add all of the vegetables and then add sherry cooking wine and 1 cup of water.",
    "To make the sauce add oyster sauce, hot pepper sauce, and sugar.",
    "add the cooked beef and 1 spoon of soy sauce",
    "To thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your stir-fry until it's the right thickness."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1529443236.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b737"
  },
  "recipeName": "Tonkatsu pork",
  "recipeType": "Pork",
  "recipeArea": "Japanese",
  "ingredients": [
    "4 Pork Chops",
    "100g  Flour",
    "2 Beaten  Eggs",
    "100g  Breadcrumbs",
    "Fry Vegetable Oil",
    "2 tbs Tomato Ketchup",
    "2 tbs Worcestershire Sauce",
    "1 tbs Oyster Sauce",
    "2 tblsp  Caster Sugar"
  ],
  "instructions": [
    "",
    "Remove the large piece of fat on the edge of each pork loin, then bash each of the loins between two pieces of baking parchment until around 1cm in thickness – you can do this using a meat tenderiser or a rolling pin. Once bashed, use your hands to reshape the meat to its original shape and thickness – this step will ensure the meat is as succulent as possible.",
    "",
    "Put the flour, eggs and panko breadcrumbs into three separate wide-rimmed bowls. Season the meat, then dip first in the flour, followed by the eggs, then the breadcrumbs.",
    "",
    "In a large frying or sauté pan, add enough oil to come 2cm up the side of the pan. Heat the oil to 180C – if you don’t have a thermometer, drop a bit of panko into the oil and if it sinks a little then starts to fry, the oil is ready. Add two pork chops and cook for 1 min 30 secs on each side, then remove and leave to rest on a wire rack for 5 mins. Repeat with the remaining pork chops.",
    "",
    "While the pork is resting, make the sauce by whisking the ingredients together, adding a splash of water if it’s particularly thick. Slice the tonkatsu and serve drizzled with the sauce."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/lwsnkl1604181187.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b738"
  },
  "recipeName": "Tamiya",
  "recipeType": "Vegetarian",
  "recipeArea": "Egyptian",
  "ingredients": [
    "3 cups  Broad Beans",
    "6 Spring Onions",
    "4 Garlic Clove",
    "1/4 cup Parsley",
    "2 tsp Cumin",
    "1 tsp  Baking Powder",
    "1/2 tsp Cayenne Pepper",
    "Spinkling Flour",
    "As required Vegetable Oil"
  ],
  "instructions": [
    "oak the beans in water to cover overnight.Drain. If skinless beans are unavailable, rub to loosen the skins, then discard the skins. Pat the beans dry with a towel.",
    "Grind the beans in a food mill or meat grinder.If neither appliance is available, process them in a food processor but only until the beans form a paste. (If blended too smoothly, the batter tends to fall apart during cooking.) Add the scallions, garlic, cilantro, cumin, baking powder, cayenne, salt, pepper, and coriander, if using.  Refrigerate for at least 30 minutes.",
    "Shape the bean mixture into 1-inch balls.Flatten slightly and coat with flour.",
    "Heat at least 1½-inches of oil over medium heat to 365 degrees.",
    "Fry the patties in batches, turning once, until golden brown on all sides, about 5 minutes.Remove with a wire mesh skimmer or slotted spoon. Serve as part of a meze or in pita bread with tomato-cucumber salad and tahina sauce."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/n3xxd91598732796.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b739"
  },
  "recipeName": "Beef Asado",
  "recipeType": "Beef",
  "recipeArea": "Filipino",
  "ingredients": [
    "1.5kg Beef",
    "1 Beef Stock Concentrate",
    "8 ounces Tomato Puree",
    "3 cups  Water",
    "6 tablespoons Soy Sauce",
    "1 tbs White Wine Vinegar",
    "2 tbs Pepper",
    "4 Bay Leaf",
    "1/2  Lemon",
    "2 tbs Tomato Sauce",
    "3 tbs Butter",
    "1/2 cup  Olive Oil",
    "1 chopped Onion",
    "4 cloves Garlic"
  ],
  "instructions": [
    "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.",
    "1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.",
    "2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.",
    "3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.",
    "4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.",
    "5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.",
    "6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.",
    "7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b73a"
  },
  "recipeName": "Fish fofos",
  "recipeType": "Seafood",
  "recipeArea": "Portuguese",
  "ingredients": [
    "600g Haddock",
    "300g Potatoes",
    "1 chopped Green Chilli",
    "3 tbs Coriander",
    "1 tsp  Cumin Seeds",
    "1/2 tsp Pepper",
    "3 cloves Garlic",
    "2 pieces  Ginger",
    "2 tbs Flour",
    "3 Eggs",
    "75g Breadcrumbs",
    "For frying Vegetable Oil"
  ],
  "instructions": [
    "",
    "Put the fish into a lidded pan and pour over enough water to cover. Bring to a simmer and gently poach for 10 minutes over a low heat with the lid on. Drain and flake the fish.",
    "",
    "Put the fish, potato, green chilli, coriander, cumin, black pepper, garlic and ginger in a large bowl. Season, add the rice flour, mix well and break in 1 egg. Stir the mixture and divide into 15, then form into small logs. Break the remaining eggs into a bowl and whisk lightly. Put the breadcrumbs into another bowl. Dip each fofo in the beaten egg followed by the breadcrumb mixture. Chill for 20 minutes.",
    "",
    "Heat 1cm of oil in a large frying pan over a medium heat. Fry the fofos in batches for 2 minutes on each side, turning gently to get an even golden brown colour all over. Drain on kitchen paper and repeat with the remaining fofos.",
    "",
    "For the onion salad, mix together the onion, coriander and lemon juice with a pinch of salt. Serve with the fofos and mango chutney."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/a15wsa1614349126.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b73b"
  },
  "recipeName": "Beef Caldereta",
  "recipeType": "Beef",
  "recipeArea": "Filipino",
  "ingredients": [
    "2kg cut cubes Beef",
    "1 Beef Stock",
    "1 tbs Soy Sauce",
    "2 cups  Water",
    "1 sliced Green Pepper",
    "1 sliced Red Pepper",
    "1 sliced Potatoes",
    "1 sliced Carrots",
    "8 ounces Tomato Puree",
    "3  tablespoons Peanut Butter",
    "5 Chilli Powder",
    "1 chopped Onion",
    "5 cloves Garlic",
    "3 tbs Olive Oil"
  ],
  "instructions": [
    "0.\tHeat oil in a cooking pot. Saute onion and garlic until onion softens",
    "1.\tAdd beef. Saute until the outer part turns light brown.",
    "2.\tAdd soy sauce. Pour tomato sauce and water. Let boil.",
    "3.\tAdd Knorr Beef Cube. Cover the pressure cooker. Cook for 30 minutes.",
    "4.\tPan-fry carrot and potato until it browns. Set aside.",
    "5.\tAdd chili pepper, liver spread and peanut butter. Stir.",
    "6.\tAdd bell peppers, fried potato and carrot. Cover the pot. Continue cooking for 5 to 7 minutes.",
    "7.\tSeason with salt and ground black pepper. Serve."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/41cxjh1683207682.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b73c"
  },
  "recipeName": "Cashew Ghoriba Biscuits",
  "recipeType": "Dessert",
  "recipeArea": "Tunisian",
  "ingredients": [
    "250g Cashew Nuts",
    "100g  Icing Sugar",
    "2 Egg Yolks",
    "2 tbs Orange Blossom Water",
    "To Glaze Icing Sugar",
    "100g  Almonds"
  ],
  "instructions": [
    "Preheat the oven at 180 C / Gas 4. Line a baking tray with greaseproof paper.",
    "In a bowl, mix the cashews and icing sugar. Add the egg yolks and orange blossom water and mix to a smooth homogeneous paste.",
    "Take lumps of the cashew paste and shape into small balls. Roll the balls in icing sugar and transfer to the baking tray. Push an almond in the centre of each ghribia.",
    "Bake until the biscuits are lightly golden, about 20 minutes. Keep an eye on them, they burn quickly."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/t3r3ka1560461972.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b73d"
  },
  "recipeName": "Eccles Cakes",
  "recipeType": "Dessert",
  "recipeArea": "British",
  "ingredients": [
    "250g Butter",
    "350g Plain Flour",
    "Juice of 1/2 Lemon",
    "25g Butter",
    "200g Currants",
    "50g Mixed Peel",
    "100g  Muscovado Sugar",
    "1 tsp  Cinnamon",
    "1 tsp  Ginger",
    "1 tsp  Allspice",
    "Zest of 1 Lemon",
    "1 beaten Eggs",
    "spinkling Sugar"
  ],
  "instructions": [
    "To make the pastry, dice the butter and put it in the freezer to go really hard. Tip flour into the bowl of a food processor with half the butter and pulse to the texture of breadcrumbs. Pour in the lemon juice and 100ml iced water, and pulse to a dough. Tip in the rest of the butter and pulse a few times until the dough is heavily flecked with butter. It is important that you don’t overdo this as the flecks of butter are what makes the pastry flaky.",
    "On a floured surface roll the pastry out to a neat rectangle about 20 x 30cm. Fold the two ends of the pastry into the middle (See picture 1), then fold in half (pic 2). Roll the pastry out again and refold the same way 3 more times resting the pastry for at least 15 mins each time between roll and fold, then leave to rest in the fridge for at least 30 mins before using.",
    "To make the filling, melt the butter in a large saucepan. Take it off the heat and stir in all the other ingredients until completely mixed, then set aside.",
    "To make the cakes, roll the pastry out until it’s just a little thicker than a £1 coin and cut out 8 rounds about 12cm across. Re-roll the trimming if needed. Place a good heaped tablespoon of mixture in the middle of each round, brush the edges of the rounds with water, then gather the pastry around the filling and squeeze it together (pic 3). Flip them over so the smooth top is upwards and pat them into a smooth round. Flatten each round with a rolling pin to an oval until the fruit just starts to poke through, then place on a baking tray. Cut 2 little slits in each Eccles cakes, brush generously with egg white and sprinkle with the sugar (pic 4).",
    "Heat the oven to 220C/200C fan/gas 8. Bake the Eccles cakes for 15-20 mins until just past golden brown and sticky. Leave to cool on a rack and enjoy while still warm or cold with a cup of tea. If you prefer, Eccles cakes also go really well served with a wedge of hard, tangy British cheese such as Lancashire or cheddar."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/wtqrqw1511639627.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b73e"
  },
  "recipeName": "Big Mac",
  "recipeType": "Beef",
  "recipeArea": "American",
  "ingredients": [
    "400g Minced Beef",
    "2 tbs Olive Oil",
    "2 Sesame Seed Burger Buns",
    "Chopped Onion",
    "1/4  Iceberg Lettuce",
    "2 sliced Cheese",
    "2 large Dill Pickles",
    "1 cup  Mayonnaise",
    "2 tsp White Wine Vinegar",
    "Pinch Pepper",
    "2 tsp Mustard",
    "1 1/2 tsp  Onion Salt",
    "1 1/2 tsp  Garlic Powder",
    "1/2 tsp Paprika"
  ],
  "instructions": [
    "For the Big Mac sauce, combine all the ingredients in a bowl, season with salt and chill until ready to use.",
    "2. To make the patties, season the mince with salt and pepper and form into 4 balls using about 1/3 cup mince each. Place each onto a square of baking paper and flatten to form into four x 15cm circles. Heat oil in a large frypan over high heat. In 2 batches, cook beef patties for 1-2 minutes each side until lightly charred and cooked through. Remove from heat and keep warm. Repeat with remaining two patties.",
    "3. Carefully slice each burger bun into three acrossways, then lightly toast.",
    "4. To assemble the burgers, spread a little Big Mac sauce over the bottom base. Top with some chopped onion, shredded lettuce, slice of cheese, beef patty and some pickle slices. Top with the middle bun layer, and spread with more Big Mac sauce, onion, lettuce, pickles, beef patty and then finish with more sauce. Top with burger lid to serve.",
    "5. After waiting half an hour for your food to settle, go for a jog."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/urzj1d1587670726.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b73f"
  },
  "recipeName": "Coddled pork with cider",
  "recipeType": "Pork",
  "recipeArea": "Irish",
  "ingredients": [
    "Knob Butter",
    "2 Pork Chops",
    "4 Bacon",
    "2 Potatoes",
    "1 Carrots",
    "1/2  Swede",
    "1/2  Cabbage",
    "1 Bay Leaf",
    "100ml Cider",
    "100g  Chicken Stock"
  ],
  "instructions": [
    "",
    "Heat the butter in a casserole dish until sizzling, then fry the pork for 2-3 mins on each side until browned. Remove from the pan.",
    "",
    "Tip the bacon, carrot, potatoes and swede into the pan, then gently fry until slightly coloured. Stir in the cabbage, sit the chops back on top, add the bay leaf, then pour over the cider and stock. Cover the pan, then leave everything to gently simmer for 20 mins until the pork is cooked through and the vegetables are tender.",
    "",
    "Serve at the table spooned straight from the dish."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/7vpsfp1608588991.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b740"
  },
  "recipeName": "Strawberries Romanoff",
  "recipeType": "Dessert",
  "recipeArea": "Russian",
  "ingredients": [
    "2 pint  Strawberries",
    "4 tbs Sugar",
    "4 tbs Grand Marnier",
    "1 cup  Cream",
    "1/4 cup Sour Cream"
  ],
  "instructions": [
    "In a medium bowl, combine hulled and quartered strawberries, 4 Tbsp sugar and 4 Tbsp liqueur, stir to combine then cover and refrigerate at least 1 hour and up to 2 hours, stirring once or twice.",
    "Two photos of cut strawberries in a bowl with one having sugar being added to the bowl Two photos of cut up strawberries for Strawberry Romanoff ",
    "Just before serving, in a large mixing bowl, combine 1 cup cold heavy cream and 1/4 cup powdered sugar, and beat with an electric mixer until stiff peaks form. Using a spatula, fold in 1/4 cup sour cream just until well blended.",
    "To serve, stir strawberries then divide between 6 serving glasses or bowls. You can spoon a little syrup over the berries if you like. You can also use this syrup to soak a cake. Spoon cream over strawberries, dividing evenly. You can also use an ice cream scoop with trigger release for a nice rounded puff of cream. Serve right away or chill and enjoy within 2 hours of assembly."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/oe8rg51699014028.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b741"
  },
  "recipeName": "Pouding chomeur",
  "recipeType": "Dessert",
  "recipeArea": "Canadian",
  "ingredients": [
    "½ cup  Butter",
    "1 cup  Sugar",
    "2 Eggs",
    "1 tsp  Vanilla Extract",
    "2 cups  Flour",
    "1 tsp  Baking Powder",
    "1 1/4 cup Milk",
    "1 1/2 cup  Maple Syrup",
    "1 1/2 cup  Brown Sugar",
    "1 1/2 cup  Single Cream",
    "1/3 cup Butter"
  ],
  "instructions": [
    "In a large bowl, with an electric mixer, mix the butter and sugar till the mix is light.",
    "Add eggs and vanilla and mix.",
    "In another bowl, mix flour and baking powder.",
    "Alternate flour mix and milk to the butter mix.",
    "Pour into a 13 inch by 9 inch greased pan.",
    "MAPLE SAUCE.",
    "In a large casserole, bring to boil the syrup, brown sugar, cream and butter and constantly stir.",
    "Reduce heat and and gently cook 2 minutes or till sauce has reduced a little bit.",
    "Pour sauce gently over cake.",
    "Bake at 325°f (160°c) about 35 minutes or till cake is light brown and when toothpick inserted comes out clean."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/yqqqwu1511816912.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b742"
  },
  "recipeName": "Kidney Bean Curry",
  "recipeType": "Vegetarian",
  "recipeArea": "Indian",
  "ingredients": [
    "1 tbls Vegetable Oil",
    "1 finely chopped  Onion",
    "2 cloves chopped Garlic",
    "1 part  Ginger",
    "1 Packet Coriander",
    "1 tsp  Cumin",
    "1 tsp  Paprika",
    "2 tsp Garam Masala",
    "400g Chopped Tomatoes",
    "400g Kidney Beans",
    "to serve Basmati Rice"
  ],
  "instructions": [
    "Heat the oil in a large frying pan over a low-medium heat. Add the onion and a pinch of salt and cook slowly, stirring occasionally, until softened and just starting to colour. Add the garlic, ginger and coriander stalks and cook for a further 2 mins, until fragrant.",
    "Add the spices to the pan and cook for another 1 min, by which point everything should smell aromatic. Tip in the chopped tomatoes and kidney beans in their water, then bring to the boil.",
    "Turn down the heat and simmer for 15 mins until the curry is nice and thick. Season to taste, then serve with the basmati rice and the coriander leaves."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/sywrsu1511463066.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b743"
  },
  "recipeName": "Massaman Beef curry",
  "recipeType": "Beef",
  "recipeArea": "Thai",
  "ingredients": [
    "85g Peanuts",
    "400ml can Coconut cream",
    "4 tbsp Massaman curry paste",
    "600g stewing cut into strips Beef",
    "450g waxy Potatoes",
    "1 cut thin wedges Onion",
    "4 leaves Lime",
    "1 Cinnamon stick",
    "1 tbsp Tamarind paste",
    "1 tbsp palm or soft light Brown sugar",
    "1 tbsp Fish Sauce",
    "1 red deseeded and finely sliced, to serve chilli",
    "to serve Jasmine Rice"
  ],
  "instructions": [
    "Heat oven to 200C/180C fan/gas 6, then roast the peanuts on a baking tray for 5 mins until golden brown. When cool enough to handle, roughly chop. Reduce oven to 180C/160C fan/gas 4.",
    "Heat 2 tbsp coconut cream in a large casserole dish with a lid. Add the curry paste and fry for 1 min, then stir in the beef and fry until well coated and sealed. Stir in the rest of the coconut with half a can of water, the potatoes, onion, lime leaves, cinnamon, tamarind, sugar, fish sauce and most of the peanuts. Bring to a simmer, then cover and cook for 2 hrs in the oven until the beef is tender.",
    "Sprinkle with sliced chilli and the remaining peanuts, then serve straight from the dish with jasmine rice."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b744"
  },
  "recipeName": "Jerk chicken with rice & peas",
  "recipeType": "Chicken",
  "recipeArea": "Jamaican",
  "ingredients": [
    "12 Chicken Thighs",
    "1/2  Lime",
    "1  bunch Spring Onions",
    "1 tbs chopped Ginger",
    "3 cloves Garlic",
    "1/2  Onion",
    "3 chopped Red Chilli",
    "1/2 teaspoon Thyme",
    "Juice of 1 Lime",
    "2 tbs Soy Sauce",
    "2 tbs Vegetable Oil",
    "3 tbs Brown Sugar",
    "1 tbs Allspice",
    "200g Basmati Rice",
    "400g Coconut Milk",
    "1  bunch Spring Onions",
    "2 sprigs Thyme",
    "2 cloves chopped Garlic",
    "1 tbs Allspice",
    "800g Kidney Beans"
  ],
  "instructions": [
    "To make the jerk marinade, combine all the ingredients in a food processor along with 1 tsp salt, and blend to a purée. If you’re having trouble getting it to blend, just keep turning off the blender, stirring the mixture, and trying again. Eventually it will start to blend up – don’t be tempted to add water, as you want a thick paste.",
    "Taste the jerk mixture for seasoning – it should taste pretty salty, but not unpleasantly, puckering salty. You can now throw in more chillies if it’s not spicy enough for you. If it tastes too salty and sour, try adding in a bit more brown sugar until the mixture tastes well balanced.",
    "Make a few slashes in the chicken thighs and pour the marinade over the meat, rubbing it into all the crevices. Cover and leave to marinate overnight in the fridge.",
    "If you want to barbecue your chicken, get the coals burning 1 hr or so before you’re ready to cook. Authentic jerked meats are not exactly grilled as we think of grilling, but sort of smoke-grilled. To get a more authentic jerk experience, add some wood chips to your barbecue, and cook your chicken over slow, indirect heat for 30 mins. To cook in the oven, heat to 180C/160C fan/gas 4. Put the chicken pieces in a roasting tin with the lime halves and cook for 45 mins until tender and cooked through.",
    "While the chicken is cooking, prepare the rice & peas. Rinse the rice in plenty of cold water, then tip it into a large saucepan with all the remaining ingredients except the kidney beans. Season with salt, add 300ml cold water and set over a high heat. Once the rice begins to boil, turn it down to a medium heat, cover and cook for 10 mins.",
    "Add the beans to the rice, then cover with a lid. Leave off the heat for 5 mins until all the liquid is absorbed. Squeeze the roasted lime over the chicken and serve with the rice & peas, and some hot sauce if you like it really spicy."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/tytyxu1515363282.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b745"
  },
  "recipeName": "Cevapi Sausages",
  "recipeType": "Beef",
  "recipeArea": "Croatian",
  "ingredients": [
    "500g Minced Beef",
    "250g Minced Pork",
    "1 Onion",
    "4 cloves Garlic",
    "3 tblsp chopped Parsley",
    "1 tbs Paprika",
    "3/4 teaspoon Baking Powder",
    "2 tbs Breadcrumbs",
    "3 tbs Water",
    "1 Vegetable Stock Cube",
    "1 tsp  Salt",
    "1 tsp  Pepper"
  ],
  "instructions": [
    "Place the ground meat in a bowl. Chop the onion very finely and grate the garlic cloves. Add to the bowl. Add the chopped parsley, all sorts of paprika, baking soda, dried breadcrumbs, water, Vegeta, salt, and pepper.",
    "Mix well with the hand mixer fitted with the dough hooks. Cover the bowl with cling film/ plastic foil and leave to rest for 1 or 2 hours in the refrigerator.",
    "Take portions of the meat mixture, about 50-55 g/ 1.7-1.9 oz/ ¼ cup portions, and form the cevapi. The rolls should be about as thick as your thumb and about 7-10 cm/ 3-4 inches long. I had 18 sausages. The recipe can be easily doubled.",
    "Grill the cevapcici on the hot grill pan or on the barbecue for about 12-14 minutes, turning them several times in between, or until brown and cooked through. I checked by cutting one in the middle and then grilling the following batches for the same period of time.",
    "Serve hot as suggested above. The cevapcici can be reheated in the oven at 180 degrees Celsius/ 350 degrees Fahrenheit for about 10 minutes or until heated through. Check one, if it is not hot enough, give the sausages a few more minutes."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/vc08jn1628769553.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a567bbdc2cd31f229b746"
  },
  "recipeName": "Nanaimo Bars",
  "recipeType": "Dessert",
  "recipeArea": "Canadian",
  "ingredients": [
    "125g Custard",
    "50g Caster Sugar",
    "5 tbs Cocoa",
    "1 beaten Egg",
    "200g shredded Digestive Biscuits",
    "100g  Desiccated Coconut",
    "50g Almonds",
    "100g  Butter",
    "4 tbs Double Cream",
    "3 tbs Custard Powder",
    "250g Icing Sugar",
    "150g Dark Chocolate",
    "50g Butter"
  ],
  "instructions": [
    "Start by making the biscuit base. In a bowl, over a pan of simmering water, melt the butter with the sugar and cocoa powder, stirring occasionally until smooth. Whisk in the egg for 2 to 3 mins until the mixture has thickened. Remove from heat and mix in the biscuit crumbs, coconut and almonds if using, then press into the base of a lined 20cm square tin. Chill for 10 mins.",
    "For the middle layer, make the custard icing; whisk together the butter, cream and custard powder until light and fluffy, then gradually add the icing sugar until fully incorporated. Spread over the bottom layer and chill in the fridge for at least 10 mins until the custard is no longer soft.",
    "Melt the chocolate and butter together in the microwave, then spread over the chilled bars and put back in the fridge. Leave until the chocolate has fully set (about 2 hrs). Take the mixture out of the tin and slice into squares to serve."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/vwuprt1511813703.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa91"
  },
  "recipeName": "Paszteciki (Polish Pasties)",
  "recipeType": "Beef",
  "recipeArea": "Polish",
  "ingredients": [
    "1 cup  Flour",
    "1/4 tsp Salt",
    "1 Yolk Egg",
    "1 Egg",
    "5 tbs Butter",
    "6 tblsp Butter",
    "1/3 cup Onion",
    "1/2 cup  Swede",
    "1/2 lb Beef Brisket",
    "2 Beaten  Eggs",
    "1 tsp  Salt",
    "1/4 tsp Pepper"
  ],
  "instructions": [
    "Sift flour and salt into a large mixing bowl.",
    "Use a spoon to push the egg yolk through a fine sieve into the flour.",
    "Add the raw egg and mix well.",
    "Beat in butter 1 tablespoon at a time.",
    "Place dough on a floured surface and knead until smooth and elastic, then wrap in waxed paper and refrigerate until firm (at least 30 minutes).",
    "In a heavy skillet, melt 2 tablespoons butter over medium heat; saute the onion and rutabaga until the onion is soft and transparent (5 minutes).",
    "Put the onions, rutabaga, and beef through a meat grinder twice if you have one, if not just chop them up as fine as possible.",
    "Melt the remaining 4 tablespoons butter over medium heat, and add the meat mixture.",
    "Cook over low heat, stirring occasionally, until all of the liquid has evaporated and the mixture is thick enough to hold its shape.",
    "Remove from heat and let cool, then stir in 1 egg, and season with salt and pepper.",
    "Preheat oven to 350°F.",
    "On a lightly floured surface, roll the dough out into a 13x8\" rectangle (1/8\" thick).",
    "Spoon the filling down the center of the rectangle lengthwise, leaving about an inch of space on each end.",
    "Lightly brush the long sides with cold water, then fold one of the long sides over the filling and the other side over the top of that.",
    "Brush the short ends with cold water and fold them over the top, enclosing the filling.",
    "Place pastry seam side down on a baking sheet and brush the top evenly with the remaining scrambled egg.",
    "Bake in preheated oven until rich golden brown (30 minutes).",
    "Slice pastry diagonally into 1.5\" long pieces and serve as an appetizer or with soup."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/c9a3l31593261890.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa92"
  },
  "recipeName": "Ayam Percik",
  "recipeType": "Chicken",
  "recipeArea": "Malaysian",
  "ingredients": [
    "6 Chicken Thighs",
    "16 Challots",
    "1 1/2  Ginger",
    "6 Garlic Clove",
    "8 Cayenne Pepper",
    "2 tbs Turmeric",
    "1 1/2  Cumin",
    "1 1/2  Coriander",
    "1 1/2  Fennel",
    "2 tbs Tamarind Paste",
    "1 can  Coconut Milk",
    "1 tsp  Sugar",
    "1 cup  Water"
  ],
  "instructions": [
    "In a blender, add the ingredients for the spice paste and blend until smooth.",
    "Over medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.",
    "Add the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes. Stir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.",
    "When the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.",
    "Preheat the oven to 425 F.",
    "Remove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.",
    "Let chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice)."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa93"
  },
  "recipeName": "Apam balik",
  "recipeType": "Dessert",
  "recipeArea": "Malaysian",
  "ingredients": [
    "200ml Milk",
    "60ml Oil",
    "2 Eggs",
    "1600g Flour",
    "3 tsp Baking Powder",
    "1/2 tsp Salt",
    "25g Unsalted Butter",
    "45g Sugar",
    "3 tbs Peanut Butter"
  ],
  "instructions": [
    "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.",
    "Spread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.",
    "Add butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.",
    "Cut into wedges and best eaten when it is warm."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa94"
  },
  "recipeName": "Egg Drop Soup",
  "recipeType": "Vegetarian",
  "recipeArea": "Chinese",
  "ingredients": [
    "3 cups  Chicken Stock",
    "1/4 tsp Salt",
    "1/4 tsp Sugar",
    "pinch Pepper",
    "1 tsp  Sesame Seed Oil",
    "1/3 cup Peas",
    "1/3 cup Mushrooms",
    "1 tbs Cornstarch",
    "2 tbs Water",
    "1/4 cup Spring Onions"
  ],
  "instructions": [
    "In a wok add chicken broth and wait for it to boil.",
    "Next add salt, sugar, white pepper, sesame seed oil.",
    "When the chicken broth is boiling add the vegetables to the wok.",
    "To thicken the sauce, whisk together 1 Tablespoon of cornstarch and 2 Tablespoon of water in a bowl and slowly add to your soup until it's the right thickness.",
    "Next add 1 egg slightly beaten with a knife or fork and add it to the soup slowly and stir for 8 seconds",
    "Serve the soup in a bowl and add the green onions on top."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1529446137.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa95"
  },
  "recipeName": "Chilli prawn linguine",
  "recipeType": "Pasta",
  "recipeArea": "Italian",
  "ingredients": [
    "280g Linguine Pasta",
    "200g Sugar Snap Peas",
    "2 tblsp  Olive Oil",
    "2 cloves chopped Garlic Clove",
    "1 large Red Chilli",
    "24 Skinned King Prawns",
    "12 Cherry Tomatoes",
    "Handful Basil Leaves",
    "Leaves Lettuce",
    "to serve Bread",
    "2 tbsp Fromage Frais",
    "Grated Zest of 2 Lime",
    "2 tsp Caster Sugar"
  ],
  "instructions": [
    "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.",
    "Cook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.",
    "Meanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.",
    "Add the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.",
    "Serve with salad leaves drizzled with the lime dressing, and warm crusty bread."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa96"
  },
  "recipeName": "Croatian Bean Stew",
  "recipeType": "Beef",
  "recipeArea": "Croatian",
  "ingredients": [
    "2 cans Cannellini Beans",
    "3 tbs Vegetable Oil",
    "2 cups  Tomatoes",
    "5 Challots",
    "2 cloves Garlic",
    "Pinch Parsley",
    "1/2 kg chopped  Chorizo"
  ],
  "instructions": [
    "Heat the oil in a pan. Add the chopped vegetables and sauté until tender. Take a pot, empty the beans together with the vegetables into it, put the sausages inside and cook for further 20 minutes on a low heat. Or, put it in an oven and bake it at a temperature of 180ºC/350ºF for 30 minutes. This dish is even better reheated the next day."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/tnwy8m1628770384.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa97"
  },
  "recipeName": "Escovitch Fish",
  "recipeType": "Seafood",
  "recipeArea": "Jamaican",
  "ingredients": [
    "2 Pounds Red Snapper",
    "1/2 cup  Vegetable Oil",
    "1 clove peeled crushed Garlic",
    "1/2 tsp Ginger",
    "2 sprigs Thyme",
    "1 Bay Leaf",
    "0.5 Red Pepper",
    "0.5 Yellow Pepper",
    "1 sliced Onion",
    "1 chopped Carrots",
    "1 tbs Sugar",
    "1/2 tsp Allspice",
    "1 tsp  Worcestershire Sauce",
    "1 Scotch Bonnet",
    "1 Lime",
    "3/4 cup  Malt Vinegar",
    "pinch Pepper"
  ],
  "instructions": [
    "Rinse fish; rub with lemon or lime, seasoned with salt and pepper or use your favorite seasoning. I used creole seasoning. Set aside or place in the oven to keep it warm until sauce is ready.",
    "In large skillet heat oil over medium heat, until hot, add the fish, cook each side- for about 5-7 minutes until cooked through and crispy on both sides. Remove fish and set aside. Drain oil and leave about 2-3 tablespoons of oil",
    "Add, bay leave, garlic and ginger, stir-fry for about a minute making sure the garlic does not burn",
    "Then add onion, bell peppers, thyme, scotch bonnet, sugar, all spice-continue stirring for about 2-3 minutes. Add vinegar, mix an adjust salt and pepper according to preference. Let it simmer for about 2 more minutes. ",
    "Discard bay leave, thyme spring and serve over fish with a side of this bammy. You may make the sauce about 2 days in advance."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1520084413.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa98"
  },
  "recipeName": "Prawn & Fennel Bisque",
  "recipeType": "Side",
  "recipeArea": "French",
  "ingredients": [
    "450g Tiger Prawns",
    "4 tbs Olive Oil",
    "1 large Onion",
    "1 large Fennel",
    "2 chopped Carrots",
    "150ml Dry White Wine",
    "1 tbs Brandy",
    "400g Chopped Tomatoes",
    "1L Fish Stock",
    "2 pinches Paprika",
    "150ml Double Cream",
    "8 Prawns"
  ],
  "instructions": [
    "Shell the prawns, then fry the shells in the oil in a large pan for about 5 mins. Add the onion, fennel and carrots and cook for about 10 mins until the veg start to soften. Pour in the wine and brandy, bubble hard for about 1 min to drive off the alcohol, then add the tomatoes, stock and paprika. Cover and simmer for 30 mins. Meanwhile, chop the prawns.",
    "Blitz the soup as finely as you can with a stick blender or food processor, then press through a sieve into a bowl. Spend a bit of time really working the mixture through the sieve as this will give the soup its velvety texture.",
    "Tip back into a clean pan, add the prawns and cook for 10 mins, then blitz again until smooth. You can make and chill this a day ahead or freeze it for 1 month. Thaw ovenight in the fridge. To serve, gently reheat in a pan with the cream. If garnishing, cook the 8 prawns in a little butter. Spoon into small bowls and top with the prawns and snipped fennel fronds."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/rtwwvv1511799504.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa99"
  },
  "recipeName": "Brie wrapped in prosciutto & brioche",
  "recipeType": "Side",
  "recipeArea": "French",
  "ingredients": [
    "375g Plain Flour",
    "50g Caster Sugar",
    "7g Yeast",
    "75g Milk",
    "3 Large Eggs",
    "To Glaze Eggs",
    "180g Butter",
    "250g Brie",
    "8 slices Prosciutto"
  ],
  "instructions": [
    "Mix the flour, 1 tsp salt, caster sugar, yeast, milk and eggs together in a mixer using the dough attachment for 5 mins until the dough is smooth. Add the butter and mix for a further 4 mins on medium speed. Scrape the dough bowl and mix again for 1 min. Place the dough in a container, cover with cling film and leave in the fridge for at least 6 hrs before using.",
    "Wrap the Brie in the prosciutto and set aside. Turn out the dough onto a lightly floured surface. Roll into a 25cm circle. Place the wrapped Brie in the middle of the circle and fold the edges in neatly. Put the parcel onto a baking tray lined with baking parchment and brush with beaten egg. Chill in the fridge for 30 mins, then brush again with beaten egg and chill for a further 30 mins. Leave to rise for 1 hr at room temperature. Heat oven to 200C/180C fan/gas 6, then bake for 22 mins. Serve warm."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/qqpwsy1511796276.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa9a"
  },
  "recipeName": "Creamy Tomato Soup",
  "recipeType": "Starter",
  "recipeArea": "British",
  "ingredients": [
    "3 tbsp Olive Oil",
    "2 chopped Onions",
    "2 sticks Celery",
    "300g Carrots",
    "500g Potatoes",
    "4 Bay Leaf",
    "5 tblsp  Tomato Puree",
    "2 tblsp  Sugar",
    "2 tblsp  White Vinegar",
    "1½ kg Chopped Tomatoes",
    "500g Passata",
    "3 Vegetable Stock Cube",
    "400ml Whole Milk"
  ],
  "instructions": [
    "Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.",
    "Stir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.",
    "To serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/stpuws1511191310.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa9b"
  },
  "recipeName": "Chicken Marengo",
  "recipeType": "Chicken",
  "recipeArea": "French",
  "ingredients": [
    "1 tbs Olive Oil",
    "300g Mushrooms",
    "4 Chicken Legs",
    "500g Passata",
    "1 Chicken Stock Cube",
    "100g  Black Olives",
    "Chopped Parsley"
  ],
  "instructions": [
    "Heat the oil in a large flameproof casserole dish and stir-fry the mushrooms until they start to soften. Add the chicken legs and cook briefly on each side to colour them a little.",
    "Pour in the passata, crumble in the stock cube and stir in the olives. Season with black pepper – you shouldn’t need salt. Cover and simmer for 40 mins until the chicken is tender. Sprinkle with parsley and serve with pasta and a salad, or mash and green veg, if you like."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/qpxvuq1511798906.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa9c"
  },
  "recipeName": "Croatian Bean Stew",
  "recipeType": "Beef",
  "recipeArea": "Croatian",
  "ingredients": [
    "2 cans Cannellini Beans",
    "3 tbs Vegetable Oil",
    "2 cups  Tomatoes",
    "5 Challots",
    "2 cloves Garlic",
    "Pinch Parsley",
    "1/2 kg chopped  Chorizo"
  ],
  "instructions": [
    "Heat the oil in a pan. Add the chopped vegetables and sauté until tender. Take a pot, empty the beans together with the vegetables into it, put the sausages inside and cook for further 20 minutes on a low heat. Or, put it in an oven and bake it at a temperature of 180ºC/350ºF for 30 minutes. This dish is even better reheated the next day."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/tnwy8m1628770384.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa9d"
  },
  "recipeName": "Burek",
  "recipeType": "Side",
  "recipeArea": "Croatian",
  "ingredients": [
    "1 Packet Filo Pastry",
    "150g Minced Beef",
    "150g Onion",
    "40g Oil",
    "Dash Salt",
    "Dash Pepper"
  ],
  "instructions": [
    "Fry the finely chopped onions and minced meat in oil. Add the salt and pepper. Grease a round baking tray and put a layer of pastry in it. Cover with a thin layer of filling and cover this with another layer of filo pastry which must be well coated in oil. Put another layer of filling and cover with pastry. When you have five or six layers, cover with filo pastry, bake at 200ºC/392ºF for half an hour and cut in quarters and serve."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/tkxquw1628771028.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa9e"
  },
  "recipeName": "Cajun spiced fish tacos",
  "recipeType": "Seafood",
  "recipeArea": "Mexican",
  "ingredients": [
    "2 tbsp cajun",
    "1 tsp cayenne pepper",
    "4 fillets white fish",
    "1 tsp vegetable oil",
    "8 flour tortilla",
    "1 sliced avocado",
    "2 shredded little gem lettuce",
    "4 shredded spring onion",
    "1 x 300ml salsa",
    "1 pot sour cream",
    "1 lemon",
    "1 clove finely chopped garlic"
  ],
  "instructions": [
    "Cooking in a cajun spice and cayenne pepper marinade makes this fish super succulent and flavoursome. Top with a zesty dressing and serve in a tortilla for a quick, fuss-free main that's delightfully summery.",
    "On a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over.",
    "Heat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Cook in batches if you don’t have enough room in the pan.",
    "Meanwhile, prepare the dressing by combining all the ingredients with a little seasoning.",
    "Soften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/uvuyxu1503067369.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13fa9f"
  },
  "recipeName": "Roast fennel and aubergine paella",
  "recipeType": "Vegan",
  "recipeArea": "Spanish",
  "ingredients": [
    "6 small Baby Aubergine",
    "4 small Fennel",
    "1 thinly sliced Red Pepper",
    "1 medium Courgettes",
    "1 finely chopped  Onion",
    "300g Paella Rice",
    "1 tsp  Paprika",
    "pinch Saffron",
    "200ml White Wine",
    "700ml Vegetable Stock",
    "100g  Frozen Peas",
    "1 chopped Lemon",
    "Handful Parsley",
    "pinch Salt",
    "pinch Black Pepper"
  ],
  "instructions": [
    "1 Put the fennel, aubergine, pepper and courgette in a roasting tray. Add a glug of olive oil, season with salt and pepper and toss around to coat the veggies in the oil. Roast in the oven for 20 minutes, turning a couple of times until the veg are pretty much cooked through and turning golden.",
    "2 Meanwhile, heat a paella pan or large frying pan over a low– medium heat and add a glug of olive oil. Sauté the onion for 8–10 minutes until softened. Increase the heat to medium and stir in the rice, paprika and saffron. Cook for around 1 minute to start toasting the rice, then add the white wine. Reduce by about half before stirring in two-thirds of the stock. Reduce to a simmer and cook for 10 minutes without a lid, stirring a couple of times.",
    "3 Stir in the peas, add some seasoning, then gently mix in the roasted veg. Pour over the remaining stock, arrange the lemon wedges on top and cover with a lid or some aluminium foil. Cook for a further 10 minutes.",
    "4 To ensure you get the classic layer of toasted rice at the bottom of the pan, increase the heat to high until you hear a slight crackle. Remove from the heat and sit for 5 minutes before sprinkling over the parsley and serving."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1520081754.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13faa0"
  },
  "recipeName": "Creamy Tomato Soup",
  "recipeType": "Starter",
  "recipeArea": "British",
  "ingredients": [
    "3 tbsp Olive Oil",
    "2 chopped Onions",
    "2 sticks Celery",
    "300g Carrots",
    "500g Potatoes",
    "4 Bay Leaf",
    "5 tblsp  Tomato Puree",
    "2 tblsp  Sugar",
    "2 tblsp  White Vinegar",
    "1½ kg Chopped Tomatoes",
    "500g Passata",
    "3 Vegetable Stock Cube",
    "400ml Whole Milk"
  ],
  "instructions": [
    "Put the oil, onions, celery, carrots, potatoes and bay leaves in a big casserole dish, or two saucepans. Fry gently until the onions are softened – about 10-15 mins. Fill the kettle and boil it.",
    "Stir in the tomato purée, sugar, vinegar, chopped tomatoes and passata, then crumble in the stock cubes. Add 1 litre boiling water and bring to a simmer. Cover and simmer for 15 mins until the potato is tender, then remove the bay leaves. Purée with a stick blender (or ladle into a blender in batches) until very smooth. Season to taste and add a pinch more sugar if it needs it. The soup can now be cooled and chilled for up to 2 days, or frozen for up to 3 months.",
    "To serve, reheat the soup, stirring in the milk – try not to let it boil. Serve in small bowls with cheesy sausage rolls."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/stpuws1511191310.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13faa1"
  },
  "recipeName": "Clam chowder",
  "recipeType": "Starter",
  "recipeArea": "American",
  "ingredients": [
    "1½ kg Clams",
    "50g Butter",
    "150g Bacon",
    "1 finely chopped  Onion",
    "sprigs of fresh Thyme",
    "1 Bay Leaf",
    "1 tbls Plain Flour",
    "150ml Milk",
    "150ml Double Cream",
    "2 medium Potatoes",
    "Chopped Parsley"
  ],
  "instructions": [
    "Rinse the clams in several changes of cold water and drain well. Tip the clams into a large pan with 500ml of water. Cover, bring to the boil and simmer for 2 mins until the clams have just opened. Tip the contents of the pan into a colander over a bowl to catch the clam stock. When cool enough to handle, remove the clams from their shells – reserving a handful of empty shells for presentation if you want. Strain the clam stock into a jug, leaving any grit in the bottom of the bowl. You should have around 800ml stock.",
    "Heat the butter in the same pan and sizzle the bacon for 3-4 mins until it starts to brown. Stir in the onion, thyme and bay and cook everything gently for 10 mins until the onion is soft and golden. Scatter over the flour and stir in to make a sandy paste, cook for 2 mins more, then gradually stir in the clam stock then the milk and the cream.",
    "Throw in the potatoes, bring everything to a simmer and leave to bubble away gently for 10 mins or until the potatoes are cooked. Use a fork to crush a few of the potato chunks against the side of the pan to help thicken – you still want lots of defined chunks though. Stir through the clam meat and the few clam shells, if you've gone down that route, and simmer for a minute to reheat. Season with plenty of black pepper and a little salt, if needed, then stir through the parsley just before ladling into bowls or hollowed-out crusty rolls."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/rvtvuw1511190488.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13faa2"
  },
  "recipeName": "Rocky Road Fudge",
  "recipeType": "Dessert",
  "recipeArea": "American",
  "ingredients": [
    "2 cups Miniature Marshmallows",
    "3 cups Chocolate Chips",
    "½ cup Peanut Butter",
    "1 tsp Vanilla Extract",
    "1 ¼ cups Peanuts"
  ],
  "instructions": [
    "Line an 8-inch-square baking pan with wax paper or foil, and coat with non-stick spray.",
    "Pour ½ cup of the miniature marshmallows into the bottom of the lined baking dish.",
    "In a microwave-safe bowl, combine the chocolate chips and peanut butter. Microwave the chocolate mixture in 20-second intervals, stirring in between each interval, until the chocolate is melted.",
    "Add the vanilla extract and stir well, until smooth.",
    "Reserve 2 tablespoons of the chopped almonds or peanuts, and set aside.",
    "Fold 1 ½ cups of the miniature marshmallows and the remaining chopped nuts into the chocolate mixture.",
    "Transfer the chocolate mixture into the prepared pan and spread into an even layer. Immediately top with the reserved chopped nuts and the mallow bits or additional miniature marshmallows, if using.",
    "Refrigerate for 4 hours, or until set.",
    "Remove the fudge and wax paper from the pan. Carefully peel all of wax paper from the fudge.",
    "Cut the fudge into bite-sized pieces and serve."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/vtxyxv1483567157.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13faa3"
  },
  "recipeName": "Piri-piri chicken and slaw",
  "recipeType": "Chicken",
  "recipeArea": "Portuguese",
  "ingredients": [
    "1.5kg Chicken",
    "3 chopped Red Chilli",
    "2 cloves Garlic",
    "1 tsp  Ginger",
    "1 tsp  Dried Oregano",
    "1 tsp  Coriander",
    "1 tsp  Paprika",
    "2 tbs Red Wine Vinegar",
    "2 tbs Oil",
    "1 sliced Red Onions",
    "2 Carrots",
    "1 Beetroot",
    "4 leaves Cabbage",
    "2 tbs Mayonnaise",
    "2 tbs Greek Yogurt",
    "2 tbs Red Wine Vinegar",
    "1 tsp  Cumin Seeds"
  ],
  "instructions": [
    "",
    "Whizz together all of the marinade ingredients in a small food processor. Rub the marinade onto the chicken and leave for 1 hour at room temperature.",
    "",
    "Heat the oven to 190C/fan 170C/gas 5. Put the chicken in a roasting tray and cook for 1 hour 20 minutes. Rest under loose foil for 20 minutes. While the chicken is resting, mix together the slaw ingredients and season. Serve the chicken with slaw, fries and condiments."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/hglsbl1614346998.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a5698c4855cc8eb13faa4"
  },
  "recipeName": "Montreal Smoked Meat",
  "recipeType": "Beef",
  "recipeArea": "Canadian",
  "ingredients": [
    "1 Beef Brisket",
    "3 tbs Salt",
    "3 tbs Black Pepper",
    "1 tbs Coriander",
    "1 tbs Sugar",
    "1 tsp  Bay Leaf",
    "1 tsp  Cloves",
    "3 tbs Black Pepper",
    "1 tbs Coriander",
    "1 tbs Paprika",
    "1 tbs Garlic",
    "1 tbs Onion",
    "1 tbs Dill",
    "1 tsp  English Mustard",
    "1 tbs Celery Salt",
    "1 tsp  Red Pepper Flakes"
  ],
  "instructions": [
    "To make the cure, in a small bowl mix together salt, pink salt, black pepper, coriander, sugar, bay leaf, and cloves. Coat entire brisket with the cure and place in an extra-large resealable plastic bag. Place in the coldest part of the refrigerator and cure for 4 days, flipping brisket twice a day.",
    "Remove brisket from bag and wash as much cure off as possible under cold running water. Place brisket in a large container and fill with water and let soak for 2 hours, replacing water every 30 minutes. Remove from water and pat dry with paper towels.",
    "To make the rub, mix together black pepper, coriander, paprika, garlic powder, onion powder, dill weed, mustard, celery seed, and crushed red papper in a small bowl. Coat entire brisket with the rub.",
    "Fire up smoker or grill to 225 degrees, adding chunks of smoking wood chunks when at temperature. When wood is ignited and producing smoke, place brisket in, fat side up, and smoke until an instant read thermometer registers 165 degrees when inserted into thickest part of the brisket, about 6 hours.",
    "Transfer brisket to large roasting pan with V-rack. Place roasting pan over two burners on stovetop and fill with 1-inch of water. Bring water to a boil over high heat, reduce heat to medium, cover roasting pan with aluminum foil, and steam brisket until an instant read thermometer registers 180 degrees when inserted into thickest part of the meat, 1 to 2 hours, adding more hot water as needed.",
    "Transfer brisket to cutting board and let cool slightly. Slice and serve, preferably on rye with mustard."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/uttupv1511815050.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb17"
  },
  "recipeName": "Chakchouka ",
  "recipeType": "Miscellaneous",
  "recipeArea": "Tunisian",
  "ingredients": [
    "4 Tomatoes",
    "2 tbs Olive Oil",
    "1 Diced Onion",
    "1 sliced Red Pepper",
    "1 sliced Green Pepper",
    "3 Cloves Crushed Garlic",
    "1 tsp  Cumin",
    "1 tsp  Paprika",
    "3/4 teaspoon Salt",
    "1/2 teaspoon Chili Powder",
    "4 Eggs"
  ],
  "instructions": [
    "In a large cast iron skillet or sauté pan with a lid, heat oil over medium high heat. Add the onion and sauté for 2-3 minutes, until softened. Add the peppers and garlic, and sauté for an additional 3-5 minutes. Add the tomatoes, cumin, paprika, salt, and chili powder. Mix well and bring the mixture to a simmer. Reduce the heat to medium low and continue to simmer, uncovered, 10-15 minutes until the mixture has thickened to your desired consistency. (Taste the sauce at this point and adjust for salt and spice, as desired.) Using the back of a spoon, make four craters in the mixture, large enough to hold an egg. Crack one egg into each of the craters. Cover the skillet and simmer for 5-7 minutes, until the eggs have set. Serve immediately with crusty bread or pita."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/gpz67p1560458984.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb18"
  },
  "recipeName": "Ful Medames",
  "recipeType": "Vegetarian",
  "recipeArea": "Egyptian",
  "ingredients": [
    "2 cups  Broad Beans",
    "1/3 cup Parsley",
    "Dash Olive Oil",
    "3 Lemons",
    "4 Garlic Clove",
    "Sprinking Cumin"
  ],
  "instructions": [
    "As the cooking time varies depending on the quality and age of the beans, it is good to cook them in advance and to reheat them when you are ready to serve. Cook the drained beans in a fresh portion of unsalted water in a large saucepan with the lid on until tender, adding water to keep them covered, and salt when the beans have softened. They take 2–2 1/2 hours of gentle simmering. When the beans are soft, let the liquid reduce. It is usual to take out a ladle or two of the beans and to mash them with some of the cooking liquid, then stir this back into the beans. This is to thicken the sauce.",
    "Serve the beans in soup bowls sprinkled with chopped parsley and accompanied by Arab bread.",
    "Pass round the dressing ingredients for everyone to help themselves: a bottle of extra-virgin olive oil, the quartered lemons, salt and pepper, a little saucer with the crushed garlic, one with chili-pepper flakes, and one with ground cumin.",
    "The beans are eaten gently crushed with the fork, so that they absorb the dressing.",
    "Optional Garnishes",
    "Peel hard-boiled eggs—1 per person—to cut up in the bowl with the beans.",
    "Top the beans with a chopped cucumber-and-tomato salad and thinly sliced mild onions or scallions. Otherwise, pass round a good bunch of scallions and quartered tomatoes and cucumbers cut into sticks.",
    "Serve with tahina cream sauce (page 65) or salad (page 67), with pickles and sliced onions soaked in vinegar for 30 minutes.",
    "Another way of serving ful medames is smothered in a garlicky tomato sauce (see page 464).",
    "In Syria and Lebanon, they eat ful medames with yogurt or feta cheese, olives, and small cucumbers.",
    "Variations",
    "A traditional way of thickening the sauce is to throw a handful of red lentils (1/4 cup) into the water at the start of the cooking.",
    "In Iraq, large brown beans are used instead of the small Egyptian ones, in a dish called badkila, which is also sold for breakfast in the street."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/lvn2d51598732465.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb19"
  },
  "recipeName": "Ayam Percik",
  "recipeType": "Chicken",
  "recipeArea": "Malaysian",
  "ingredients": [
    "6 Chicken Thighs",
    "16 Challots",
    "1 1/2  Ginger",
    "6 Garlic Clove",
    "8 Cayenne Pepper",
    "2 tbs Turmeric",
    "1 1/2  Cumin",
    "1 1/2  Coriander",
    "1 1/2  Fennel",
    "2 tbs Tamarind Paste",
    "1 can  Coconut Milk",
    "1 tsp  Sugar",
    "1 cup  Water"
  ],
  "instructions": [
    "In a blender, add the ingredients for the spice paste and blend until smooth.",
    "Over medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.",
    "Add the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes. Stir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.",
    "When the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.",
    "Preheat the oven to 425 F.",
    "Remove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.",
    "Let chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice)."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb1a"
  },
  "recipeName": "Oxtail with broad beans",
  "recipeType": "Beef",
  "recipeArea": "Jamaican",
  "ingredients": [
    "450g Oxtail",
    "1 chopped Onion",
    "1 Spring Onions",
    "2 cloves minced Garlic",
    "1 tsp  Ginger",
    "1 chopped Scotch Bonnet",
    "2 tbs Soy Sauce",
    "1 chopped Fresh Thyme",
    "2 tbs Vegetable Oil",
    "350ml Water",
    "200g Broad Beans",
    "1 tbs Corn Flour",
    "2 tbs Water"
  ],
  "instructions": [
    "Toss the oxtail with the onion, spring onion, garlic, ginger, chilli, soy sauce, thyme, salt and pepper. Heat the vegetable oil in a large frying pan over medium-high heat. Brown the oxtail in the pan until browned all over, about 10 minutes. Place into a pressure cooker, and pour in 375ml water. Cook at pressure for 25 minutes, then remove from heat, and remove the lid according to manufacturer's directions.",
    "Add the broad beans and pimento berries, and bring to a simmer over medium-high heat. Dissolve the cornflour in 2 tablespoons water, and stir into the simmering oxtail. Cook and stir a few minutes until the sauce has thickened, and the broad beans are tender."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1520083578.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb1b"
  },
  "recipeName": "Beef Lo Mein",
  "recipeType": "Beef",
  "recipeArea": "Chinese",
  "ingredients": [
    "1/2 lb Beef",
    "pinch Salt",
    "pinch Pepper",
    "2 tsp Sesame Seed Oil",
    "1/2  Egg",
    "3 tbs Starch",
    "5 tbs Oil",
    "1/4 lb Noodles",
    "1/2 cup  Onion",
    "1 tsp  Minced Garlic",
    "1 tsp  Ginger",
    "1 cup  Bean Sprouts",
    "1 cup  Mushrooms",
    "1 cup  Water",
    "1 tbs Oyster Sauce",
    "1 tsp  Sugar",
    "1 tsp  Soy Sauce"
  ],
  "instructions": [
    "- MARINATING THE BEEF",
    "In a bowl, add the beef, salt, 1 pinch white pepper, 1 Teaspoon sesame seed oil, 1/2 egg, corn starch,1 Tablespoon of oil and mix together.",
    "- BOILING THE THE NOODLES",
    "In a 6 qt pot add your noodles to boiling water until the noodles are submerged and boil on high heat for 10 seconds. After your noodles is done boiling strain and cool with cold water.",
    "- STIR FRY",
    "Add 2 Tablespoons of oil, beef and cook on high heat untill beef is medium cooked.",
    "Set the cooked beef aside",
    "In a wok add 2 Tablespoon of oil, onions, minced garlic, minced ginger, bean sprouts, mushrooms, peapods and 1.5 cups of water or until the vegetables are submerged in water.",
    "Add the noodles to wok",
    "To make the sauce, add oyster sauce, 1 pinch white pepper, 1 teaspoon sesame seed oil, sugar, and 1 Teaspoon of soy sauce.",
    "Next add the beef to wok and stir-fry"
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1529444830.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb1c"
  },
  "recipeName": "Smoked Haddock Kedgeree",
  "recipeType": "Breakfast",
  "recipeArea": "Indian",
  "ingredients": [
    "50g Butter",
    "1 chopped Onion",
    "3 Pods Cardamom",
    "1/4 tsp Turmeric",
    "1 small Cinnamon Stick",
    "Sprigs of fresh Bay Leaf",
    "450g Basmati Rice",
    "1 Litre Chicken Stock",
    "750g Smoked Haddock",
    "3 Eggs",
    "3 tblsp chopped Parsley",
    "1 chopped Lemon"
  ],
  "instructions": [
    "Melt 50g butter in a large saucepan (about 20cm across), add 1 finely chopped medium onion and cook gently over a medium heat for 5 minutes, until softened but not browned.",
    "Stir in 3 split cardamom pods, ¼ tsp turmeric, 1 small cinnamon stick and 2 bay leaves, then cook for 1 minute.",
    "Tip in 450g basmati rice and stir until it is all well coated in the spicy butter.",
    "Pour in 1 litre chicken or fish stock, add ½ teaspoon salt and bring to the boil, stir once to release any rice from the bottom of the pan. Cover with a close-fitting lid, reduce the heat to low and leave to cook very gently for 12 minutes.",
    "Meanwhile, bring some water to the boil in a large shallow pan. Add 750g un-dyed smoked haddock fillet and simmer for 4 minutes, until the fish is just cooked. Lift it out onto a plate and leave until cool enough to handle.",
    "Hard-boil 3 eggs for 8 minutes.",
    "Flake the fish, discarding any skin and bones. Drain the eggs, cool slightly, then peel and chop. ",
    "Uncover the rice and remove the bay leaves, cinnamon stick and cardamom pods if you wish to. Gently fork in the fish and the chopped eggs, cover again and return to the heat for 2-3 minutes, or until the fish has heated through.",
    "Gently stir in almost all the 3 tbsp chopped fresh parsley, and season with a little salt and black pepper to taste. Serve scattered with the remaining parsley and garnished with 1 lemon, cut into wedges."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1550441275.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb1d"
  },
  "recipeName": "Three-cheese souffles",
  "recipeType": "Miscellaneous",
  "recipeArea": "French",
  "ingredients": [
    "50g Butter",
    "25g Parmesan",
    "300ml  Milk",
    "2 Bay Leaves",
    "5 tbs Plain Flour",
    "½ tsp English Mustard",
    "Pod of Cayenne Pepper",
    "140g Gruyère",
    "3 Eggs",
    "8 slices Goats Cheese",
    "150ml Double Cream",
    "to serve Spinach"
  ],
  "instructions": [
    "Heat oven to 200C/180C fan/ gas 6 and butter 4 small (about 200ml) ramekins. Sprinkle the Parmesan into the ramekins, turning until all sides are covered. Place the milk and bay leaves in a large saucepan over a gentle heat and bring to the boil. Turn off the heat and leave to infuse for 15 mins.",
    "Discard the bay leaves, add the butter and flour, and return to a low heat. Very gently simmer, stirring continuously with a balloon whisk, for about 6 mins until you get a smooth, thick white sauce. Make sure that you get right into the corners of the pan to stop the sauce from catching or becoming lumpy.",
    "Once thickened, transfer the sauce to a large bowl and stir in the mustard powder, cayenne pepper, Gruyère and egg yolks until fully combined.",
    "In a spotlessly clean bowl and with a clean whisk, beat the egg whites just until peaks begin to form.",
    "Carefully fold the egg whites into the cheese sauce in three stages making sure you fold, rather than stir, to keep the egg whites light and airy. Fill the prepared ramekins with the soufflé mix.",
    "Top each soufflé with a slice of goat’s cheese, then place on a baking tray. Bake for 20-25 mins or until springy and well risen but cooked through.",
    "Leave to cool, then run a knife around the edge of each dish and remove the soufflés. If preparing in advance, place soufflés upside down (for neat presentation), on a tray. Cover tray in cling film. Chill for a few days or freeze for up to 1 month.",
    "When ready to re-bake, heat oven to 200C/180C fan/gas 6. Place the upside-down soufflés in a shallow baking dish, top with the remaining goat’s cheese slices and pour over the cream (this stops them from drying out when baked for the second time). Cook for 8-10 mins until golden. Serve immediately alongside some simply dressed salad."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/sxwquu1511793428.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb1e"
  },
  "recipeName": "Banana Pancakes",
  "recipeType": "Dessert",
  "recipeArea": "American",
  "ingredients": [
    "1 large Banana",
    "2 medium Eggs",
    "pinch Baking Powder",
    "spinkling Vanilla Extract",
    "1 tsp  Oil",
    "25g Pecan Nuts",
    "125g Raspberries"
  ],
  "instructions": [
    "In a bowl, mash the banana with a fork until it resembles a thick purée. Stir in the eggs, baking powder and vanilla.",
    "Heat a large non-stick frying pan or pancake pan over a medium heat and brush with half the oil. Using half the batter, spoon two pancakes into the pan, cook for 1-2 mins each side, then tip onto a plate. Repeat the process with the remaining oil and batter. Top the pancakes with the pecans and raspberries."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/sywswr1511383814.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb1f"
  },
  "recipeName": "Minced Beef Pie",
  "recipeType": "Beef",
  "recipeArea": "British",
  "ingredients": [
    "2 tbs Vegetable Oil",
    "500g Minced Beef",
    "1 chopped Onion",
    "1 tbls Tomato Puree",
    "1 ½ tbsp Plain Flour",
    "75g Mushrooms",
    "250ml Beef Stock",
    "Dash Worcestershire Sauce",
    "400g Shortcrust Pastry",
    "1 Egg Yolks"
  ],
  "instructions": [
    "Preheat the oven to 200C/400F/Gas 6.",
    "Heat the oil in a deep frying pan and fry the beef mince for 4-5 minutes, breaking it up with a wooden spoon as it browns.",
    "Add the onion and cook for 2-3 minutes, then stir in the tomato purée and cook for 2-3 more minutes. Stir in the flour and cook for a further minute, then add the chopped mushrooms, the stout or beef stock and a couple of dashes of Worcestershire sauce. Bring to the boil, then reduce the heat, cover the pan with a lid and leave to simmer for 20 minutes. Set aside and leave to cool, then turn the meat mixture into a one litre pie dish.",
    "Roll out the pastry on a floured work surface until it is slightly larger than the pie dish. Gently drape the pastry over the dish, pressing firmly onto the edges. Trim, then shape the edges into a fluted shape.",
    "Cut some leaf shapes out of the pastry trimmings and decorate the top of the pie, sticking them to the pastry with the beaten egg yolk.",
    "Make three or four slits in the pastry to allow the steam to escape, then brush the pie with the rest of the beaten egg yolk and bake in the oven for 20-25 minutes, or until golden-brown.",
    "To serve, slice into wedges."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/xwutvy1511555540.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb20"
  },
  "recipeName": "Vegan Chocolate Cake",
  "recipeType": "Vegan",
  "recipeArea": "American",
  "ingredients": [
    "1 1/4 cup self raising flour",
    "1/2 cup coco sugar",
    "1/3 cup raw cacao",
    "1 tsp baking powder",
    "2 flax eggs",
    "1/2 cup almond milk",
    "1 tsp vanilla",
    "1/2 cup boiling water"
  ],
  "instructions": [
    "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate "
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb21"
  },
  "recipeName": "Prawn & Fennel Bisque",
  "recipeType": "Side",
  "recipeArea": "French",
  "ingredients": [
    "450g Tiger Prawns",
    "4 tbs Olive Oil",
    "1 large Onion",
    "1 large Fennel",
    "2 chopped Carrots",
    "150ml Dry White Wine",
    "1 tbs Brandy",
    "400g Chopped Tomatoes",
    "1L Fish Stock",
    "2 pinches Paprika",
    "150ml Double Cream",
    "8 Prawns"
  ],
  "instructions": [
    "Shell the prawns, then fry the shells in the oil in a large pan for about 5 mins. Add the onion, fennel and carrots and cook for about 10 mins until the veg start to soften. Pour in the wine and brandy, bubble hard for about 1 min to drive off the alcohol, then add the tomatoes, stock and paprika. Cover and simmer for 30 mins. Meanwhile, chop the prawns.",
    "Blitz the soup as finely as you can with a stick blender or food processor, then press through a sieve into a bowl. Spend a bit of time really working the mixture through the sieve as this will give the soup its velvety texture.",
    "Tip back into a clean pan, add the prawns and cook for 10 mins, then blitz again until smooth. You can make and chill this a day ahead or freeze it for 1 month. Thaw ovenight in the fridge. To serve, gently reheat in a pan with the cream. If garnishing, cook the 8 prawns in a little butter. Spoon into small bowls and top with the prawns and snipped fennel fronds."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/rtwwvv1511799504.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb22"
  },
  "recipeName": "Chilli prawn linguine",
  "recipeType": "Pasta",
  "recipeArea": "Italian",
  "ingredients": [
    "280g Linguine Pasta",
    "200g Sugar Snap Peas",
    "2 tblsp  Olive Oil",
    "2 cloves chopped Garlic Clove",
    "1 large Red Chilli",
    "24 Skinned King Prawns",
    "12 Cherry Tomatoes",
    "Handful Basil Leaves",
    "Leaves Lettuce",
    "to serve Bread",
    "2 tbsp Fromage Frais",
    "Grated Zest of 2 Lime",
    "2 tsp Caster Sugar"
  ],
  "instructions": [
    "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.",
    "Cook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.",
    "Meanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.",
    "Add the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.",
    "Serve with salad leaves drizzled with the lime dressing, and warm crusty bread."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb23"
  },
  "recipeName": "Brie wrapped in prosciutto & brioche",
  "recipeType": "Side",
  "recipeArea": "French",
  "ingredients": [
    "375g Plain Flour",
    "50g Caster Sugar",
    "7g Yeast",
    "75g Milk",
    "3 Large Eggs",
    "To Glaze Eggs",
    "180g Butter",
    "250g Brie",
    "8 slices Prosciutto"
  ],
  "instructions": [
    "Mix the flour, 1 tsp salt, caster sugar, yeast, milk and eggs together in a mixer using the dough attachment for 5 mins until the dough is smooth. Add the butter and mix for a further 4 mins on medium speed. Scrape the dough bowl and mix again for 1 min. Place the dough in a container, cover with cling film and leave in the fridge for at least 6 hrs before using.",
    "Wrap the Brie in the prosciutto and set aside. Turn out the dough onto a lightly floured surface. Roll into a 25cm circle. Place the wrapped Brie in the middle of the circle and fold the edges in neatly. Put the parcel onto a baking tray lined with baking parchment and brush with beaten egg. Chill in the fridge for 30 mins, then brush again with beaten egg and chill for a further 30 mins. Leave to rise for 1 hr at room temperature. Heat oven to 200C/180C fan/gas 6, then bake for 22 mins. Serve warm."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/qqpwsy1511796276.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb24"
  },
  "recipeName": "Vegetable Shepherd's Pie",
  "recipeType": "Beef",
  "recipeArea": "Irish",
  "ingredients": [
    "3 Lbs Potatoes",
    "3 Lbs Small Potatoes",
    "1/2 cup  Salted Butter",
    "1 oz  Mushrooms",
    "3/4 cup  Brown Lentils",
    "6 cloves Garlic",
    "1 tsp  Kosher Salt",
    "3 cups  Onion",
    "2 tbsp Tomato Puree",
    "  Bay Leaves",
    "  Olive Oil",
    "2 cups  Dry White Wine",
    "8 cups  Vegetable Stock",
    "2 tbsp Cornstarch",
    "2 tsp Soy Sauce",
    "2 sprigs Rosemary",
    "  Parsley",
    "  Sage",
    "  Chives"
  ],
  "instructions": [
    "Add Ingredients:",
    "12 cups chopped mixed vegetables",
    "1   cup chopped fresh mushrooms ",
    "1   cup pearl onions",
    "TOPPING:",
    "Preheat oven to 450°. Bake potatoes on a foil-lined baking sheet until tender, about 45 minutes. Let cool slightly, then peel. Press potatoes through a ricer, food mill, or colander into a large bowl. Add butter; stir until well blended. Stir in milk. Season to taste with salt.",
    "FILLING:",
    "Soak dried porcini in 3 cups hot water; set aside. Combine lentils, 1 garlic clove, 1 tsp. salt, and 4 cups water in a medium saucepan. Bring to a boil; reduce heat and simmer, stirring occasionally, until lentils are tender but not mushy, 15–20 minutes. Drain lentils and discard garlic.",
    "Heat 3 Tbsp. oil in a large heavy pot over medium heat. Add onions and cook, stirring occasionally, until soft, about 12 minutes. Add chopped garlic and cook for 1 minute. Stir in tomato paste. Cook, stirring constantly, until tomato paste is caramelized, 2–3 minutes.",
    "Add bay leaves and wine; stir, scraping up any browned bits. Stir in porcini, slowly pouring porcini soaking liquid into pan but leaving any sediment behind. Bring to a simmer and cook until liquid is reduced by half, about 10 minutes. Stir in broth and cook, stirring occasionally, until reduced by half, about 45 minutes.",
    "Strain mixture into a large saucepan and bring to a boil; discard solids in strainer. Stir cornstarch and 2 Tbsp. water in a small bowl to dissolve. Add cornstarch mixture; simmer until thickened, about 5 minutes. Whisk in miso. Season sauce with salt and pepper. Set aside.",
    "Preheat oven to 450°. Toss vegetables and pearl onions with remaining 2 Tbsp. oil, 5 garlic cloves, and rosemary sprigs in a large bowl; season with salt and pepper. Divide between 2 rimmed baking sheets. Roast, stirring once, until tender, 20–25 minutes. Transfer garlic cloves to a small bowl; mash well with a fork and stir into sauce. Discard rosemary. DO AHEAD: Lentils, sauce, and vegetables can be made 1 day ahead. Cover separately; chill.",
    "Arrange lentils in an even layer in a 3-qt. baking dish; set dish on a foil-lined rimmed baking sheet. Toss roasted vegetables with fresh mushrooms and chopped herbs; layer on top of lentils. Pour sauce over vegetables. Spoon potato mixture evenly over.",
    "Bake until browned and bubbly, about 30 minutes. Let stand for 15 minutes before serving."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/w8umt11583268117.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb25"
  },
  "recipeName": "Beef Asado",
  "recipeType": "Beef",
  "recipeArea": "Filipino",
  "ingredients": [
    "1.5kg Beef",
    "1 Beef Stock Concentrate",
    "8 ounces Tomato Puree",
    "3 cups  Water",
    "6 tablespoons Soy Sauce",
    "1 tbs White Wine Vinegar",
    "2 tbs Pepper",
    "4 Bay Leaf",
    "1/2  Lemon",
    "2 tbs Tomato Sauce",
    "3 tbs Butter",
    "1/2 cup  Olive Oil",
    "1 chopped Onion",
    "4 cloves Garlic"
  ],
  "instructions": [
    "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.",
    "1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.",
    "2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.",
    "3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.",
    "4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.",
    "5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.",
    "6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.",
    "7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb26"
  },
  "recipeName": "Vegan Chocolate Cake",
  "recipeType": "Vegan",
  "recipeArea": "American",
  "ingredients": [
    "1 1/4 cup self raising flour",
    "1/2 cup coco sugar",
    "1/3 cup raw cacao",
    "1 tsp baking powder",
    "2 flax eggs",
    "1/2 cup almond milk",
    "1 tsp vanilla",
    "1/2 cup boiling water"
  ],
  "instructions": [
    "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate "
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb27"
  },
  "recipeName": "Timbits",
  "recipeType": "Dessert",
  "recipeArea": "Canadian",
  "ingredients": [
    "2 cups  Flour",
    "1/3 cup Sugar",
    "3 tsp Baking Powder",
    "½ tsp Salt",
    "1 beaten Egg",
    "¾ cup Milk",
    "3 tbs Oil",
    "for frying Oil",
    "garnish Icing Sugar"
  ],
  "instructions": [
    "Sift together dry ingredients.",
    "Mix together wet ingredients and incorporate into dry. Stir until smooth.",
    "Drop by teaspoonfuls(no bigger) into hot oil (365 degrees, no hotter), turning after a few moments until golden brown on all sides.",
    "Remove and drain.",
    "Roll in cinnamon sugar while still warm and serve."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/txsupu1511815755.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb28"
  },
  "recipeName": "Coq au vin",
  "recipeType": "Chicken",
  "recipeArea": "French",
  "ingredients": [
    "1½ tbsp Olive Oil",
    "3 rashers (100g) chopped dry-cured Bacon",
    "12 small Shallots",
    "2 (460g) Chicken Legs",
    "4 (650g) Chicken Thighs",
    "2 (280g) Chicken Breasts",
    "3 finely chopped Garlic",
    "3 tbsp Brandy",
    "600ml Red Wine",
    "150ml Chicken Stock",
    "2 tsp tomato puree",
    "3 sprigs thyme",
    "2 sprigs Rosemary",
    "2 bay leaves",
    "garnish parsley",
    "250g chestnut mushroom",
    "2 tbsp plain flour",
    "1 tsp butter"
  ],
  "instructions": [
    "Heat 1 tbsp of the oil in a large, heavy-based saucepan or flameproof dish. Tip in the bacon and fry until crisp. Remove and drain on kitchen paper. Add the shallots to the pan and fry, stirring or shaking the pan often, for 5-8 mins until well browned all over. Remove and set aside with the bacon.",
    "Pat the chicken pieces dry with kitchen paper. Pour the remaining oil into the pan, then fry half the chicken pieces, turning regularly, for 5-8 mins until well browned. Remove, then repeat with the remaining chicken. Remove and set aside.",
    "Scatter in the garlic and fry briefly, then, with the heat medium-high, pour in the brandy or Cognac, stirring the bottom of the pan to deglaze. The alcohol should sizzle and start to evaporate so there is not much left.",
    "Return the chicken legs and thighs to the pan along with any juices, then pour in a little of the wine, stirring the bottom of the pan again. Stir in the rest of the wine, the stock and tomato purée, drop in the bouquet garni, season with pepper and a pinch of salt, then return the bacon and shallots to the pan. Cover, lower the heat to a gentle simmer, add the chicken breasts and cook for 50 mins-1hr.",
    "Just before ready to serve, heat the oil for the mushrooms in a large non-stick frying pan. Add the mushrooms and fry over a high heat for a few mins until golden. Remove and keep warm.",
    "Lift the chicken, shallots and bacon from the pan and transfer to a warmed serving dish. Remove the bouquet garni. To make the thickener, mix the flour, olive oil and butter in a small bowl using the back of a teaspoon. Bring the wine mixture to a gentle boil, then gradually drop in small pieces of the thickener, whisking each piece in using a wire whisk. Simmer for 1-2 mins. Scatter the mushrooms over the chicken, then pour over the wine sauce. Garnish with chopped parsley."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/qstyvs1505931190.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb29"
  },
  "recipeName": "Keleya Zaara",
  "recipeType": "Lamb",
  "recipeArea": "Tunisian",
  "ingredients": [
    "4 tbs Olive Oil",
    "750g Lamb",
    "1 1/2 tsp  Saffron",
    "1 Large Chopped Onion",
    "25 ml Water",
    "30g Parsley",
    "1 tbs Butter",
    "1 Lemon"
  ],
  "instructions": [
    "Heat the vegetable oil in a large frying pan over medium-high heat. Add the lamb and cook until browned on all sides, about 5 minutes. Season with saffron, salt and pepper to taste; stir in all but 4 tablespoons of the onion, and pour in the water. Bring to the boil, then cover, reduce heat to medium-low, and simmer until the lamb is tender, about 15 minutes.",
    "Uncover the pan, stir in the butter and allow the sauce reduce 5 to 10 minutes to desired consistency. Season to taste with salt and pepper, then pour into a serving dish. Sprinkle with the remaining chopped onions and parsley. Garnish with lemon wedges to serve."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/8x09hy1560460923.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56a0e26653b03eddfb2a"
  },
  "recipeName": "Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber",
  "recipeType": "Beef",
  "recipeArea": "Vietnamese",
  "ingredients": [
    "White Rice",
    "1 Onion",
    "1 Lime",
    "3 Garlic Clove",
    "1 Cucumber",
    "3 oz  Carrots",
    "1 lb Ground Beef",
    "2 oz  Soy Sauce"
  ],
  "instructions": [
    "Add'l ingredients: mayonnaise, siracha",
    "1",
    "Place rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.",
    "2",
    "Meanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.",
    "3",
    "In a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.",
    "4",
    "Heat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.",
    "5",
    "Fluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febab"
  },
  "recipeName": "Leblebi Soup",
  "recipeType": "Vegetarian",
  "recipeArea": "Tunisian",
  "ingredients": [
    "2 tbs Olive Oil",
    "1 medium finely diced Onion",
    "250g Chickpeas",
    "1.5L Vegetable Stock",
    "1 tsp  Cumin",
    "5 cloves Garlic",
    "1/2 tsp Salt",
    "1 tsp  Harissa Spice",
    "Pinch Pepper",
    "1/2  Lime"
  ],
  "instructions": [
    "Heat the oil in a large pot. Add the onion and cook until translucent.",
    "Drain the soaked chickpeas and add them to the pot together with the vegetable stock. Bring to the boil, then reduce the heat and cover. Simmer for 30 minutes.",
    "In the meantime toast the cumin in a small ungreased frying pan, then grind them in a mortar. Add the garlic and salt and pound to a fine paste.",
    "Add the paste and the harissa to the soup and simmer until the chickpeas are tender, about 30 minutes.",
    "Season to taste with salt, pepper and lemon juice and serve hot."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/x2fw9e1560460636.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febac"
  },
  "recipeName": "Steak Diane",
  "recipeType": "Beef",
  "recipeArea": "French",
  "ingredients": [
    "2 tbs Canola Oil",
    "4 Beef Fillet",
    "1 1/2 cup  Beef Stock",
    "2 tbs Butter",
    "2 cloves minced Garlic",
    "1 medium finely diced Challots",
    "4 oz  Mushrooms",
    "¼ cup Brandy",
    "¼ cup Heavy Cream",
    "1 tbs Dijon Mustard",
    "1 tbs Worcestershire Sauce",
    "Dash Tabasco Sauce",
    "1 tbs minced Parsley",
    "1 tbs minced Chives",
    "to taste Salt",
    "to taste Pepper"
  ],
  "instructions": [
    "Heat oil in a 12\" skillet over medium-high heat. Season steaks with salt and pepper, and add to skillet; cook, turning once, until browned on both sides and cooked to desired doneness, about 4 to 5 minutes for medium-rare. Transfer steaks to a plate, and set aside.",
    "Return skillet to high heat, and add stock; cook until reduced until to 1⁄2 cup, about 10 minutes. Pour into a bowl, and set aside. Return skillet to heat, and add butter; add garlic and shallots, and cook, stirring, until soft, about 2 minutes. Add mushrooms, and cook, stirring, until they release any liquid and it evaporates and mushrooms begin to brown, about 2 minutes. Add cognac, and light with a match to flambée; cook until flame dies down. Stir in reserved stock, cream, Dijon, Worcestershire, and hot sauce, and then return steaks to skillet; cook, turning in sauce, until warmed through and sauce is thickened, about 4 minutes. Transfer steak to serving plates and stir parsley and chives into sauce; pour sauce over steaks to serve."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/vussxq1511882648.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febad"
  },
  "recipeName": "Chocolate Avocado Mousse",
  "recipeType": "Dessert",
  "recipeArea": "British",
  "ingredients": [
    "1 Banana",
    "3 tbsp Cacao",
    "1 Avocado",
    "2 tblsp  Honey",
    "1 tsp  Lemon Juice",
    "1 tsp  Vanilla",
    "2 tbsp Water",
    "pinch Sea Salt"
  ],
  "instructions": [
    "1. Blend all the mousse ingredients together in your food processor until smooth. Add the cacao powder first and, as you blend, have all the ingredients to hand in order to adjust the ratios slightly as the size of avocados and bananas varies so much. The perfect ratio in order to avoid the dish tasting too much of either is to use equal amounts of both.",
    "2. Taste and add a few drops of stevia if you feel you need more sweetness.",
    "3. Fill little cups or shot glasses with the mousse, sprinkle with the cacao powder or nibs and serve.",
    "Tip If you don’t have a frozen banana to hand you can just use a normal one and then chill the mousse before serving for a cooling dessert."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/uttuxy1511382180.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febae"
  },
  "recipeName": "Rogaliki (Polish Croissant Cookies)",
  "recipeType": "Dessert",
  "recipeArea": "Polish",
  "ingredients": [
    "1 cup  Butter",
    "3 Egg Yolks",
    "8 oz  Cream Cheese",
    "1 tsp  Baking Powder",
    "3 cups  Flour",
    "1 Jar Jam"
  ],
  "instructions": [
    "In a medium bowl mix egg yolks, philly cheese and baking powder using a hand held mixer. Carefully start adding the flour. When the mixture will not be mixing well, and will look like wood chips, put away the blending mixer and using your hands knead the dough.",
    "Create a roll and cover in foil and freeze for 15 minutes. At this time preheat the oven to 375.",
    "Take the dough out and separate into two. Roll and cut out 3 inch trangles.",
    "Make as many as you can and on centre of each put a small spoon of jam. Roll them into a croissant shape.",
    "Place the croissants onto a greased cookie sheet, and bake for 10-12 minutes or until golden.",
    "Repeat with the rest of the dough.",
    "When you take them out, put aside and sprinkle with powdered sugar on top.",
    "This makes about 3 batches of 20 cookies each.",
    "Total count about 60 cookies."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/7mxnzz1593350801.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febaf"
  },
  "recipeName": "Ma Po Tofu",
  "recipeType": "Beef",
  "recipeArea": "Chinese",
  "ingredients": [
    "450g Tofu",
    "100g  Minced Beef",
    "1/2 tbs Sesame Seed Oil",
    "1 1/2 tsp  Doubanjiang",
    "1/2 tsp Fermented Black Beans",
    "1 tbs Pepper",
    "1/2 tsp Salt",
    "1/2 tsp Sichuan pepper",
    "1 tbs Soy Sauce",
    "400ml Water",
    "2 tbs Olive Oil",
    "2 chopped Scallions",
    "4 Spring Onions",
    "2 cloves chopped Garlic",
    "4 sliced Ginger",
    "2 1/2 tbs Water",
    "1 tbs Cornstarch"
  ],
  "instructions": [
    "Add a small pinch of salt and sesame oil to minced beef. Mix well and set aside.",
    "Mix 1 tablespoon of cornstarch with 2 and ½ tablespoons of water in a small bowl to make water starch.",
    "Cut tofu into square cubes (around 2cms). Bring a large amount of water to a boil and then add a pinch of salt. Slide the tofu in and cook for 1 minute. Move out and drain.",
    "Get a wok and heat up around 2 tablespoons of oil, fry the minced meat until crispy. Transfer out beef out and leave the oil in.",
    "Fry doubanjiang for 1 minute over slow fire and then add garlic, scallion white, ginger and fermented black beans to cook for 30 seconds until aroma. Then mix pepper flakes in.",
    "Add water to the seasonings and bring to boil over high fire. Gently slide the tofu cubes. Add light soy sauce and beef.Slow the heat after boiling and then simmer for 6-8 minutes. Then add chopped garlic greens.",
    "Stir the water starch and then pour half of the mixture to the simmering pot. Wait for around 30 seconds and then pour the other half. You can slightly taste the tofu and add pinch of salt if not salty enough. By the way, if you feel it is too spicy, add some sugar can milder the taste. But be carefully as the broth is very hot at this point.",
    "Transfer out when almost all the seasonings stick to tofu cubes. Sprinkle Szechuan peppercorn powder (to taste)and chopped garlic greens if using.",
    "Serve immediately with steamed rice."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1525874812.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb0"
  },
  "recipeName": "French Lentils With Garlic and Thyme",
  "recipeType": "Miscellaneous",
  "recipeArea": "French",
  "ingredients": [
    "3 tablespoons Olive Oil",
    "1 Onion",
    "2 cloves Garlic",
    "1 Carrot",
    "2 1/4 cups French Lentils",
    "1 teaspoon Thyme",
    "3 Bay Leaf",
    "1 tablespoon Salt",
    "2 sticks Celery"
  ],
  "instructions": [
    "Place a large saucepan over medium heat and add oil. When hot, add chopped vegetables and sauté until softened, 5 to 10 minutes.",
    "Add 6 cups water, lentils, thyme, bay leaves and salt. Bring to a boil, then reduce to a fast simmer.",
    "Simmer lentils until they are tender and have absorbed most of the water, 20 to 25 minutes. If necessary, drain any excess water after lentils have cooked. Serve immediately, or allow them to cool and reheat later.",
    "For a fuller taste, use some chicken stock and reduce the water by the same amount."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/vwwspt1487394060.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb1"
  },
  "recipeName": "Tamiya",
  "recipeType": "Vegetarian",
  "recipeArea": "Egyptian",
  "ingredients": [
    "3 cups  Broad Beans",
    "6 Spring Onions",
    "4 Garlic Clove",
    "1/4 cup Parsley",
    "2 tsp Cumin",
    "1 tsp  Baking Powder",
    "1/2 tsp Cayenne Pepper",
    "Spinkling Flour",
    "As required Vegetable Oil"
  ],
  "instructions": [
    "oak the beans in water to cover overnight.Drain. If skinless beans are unavailable, rub to loosen the skins, then discard the skins. Pat the beans dry with a towel.",
    "Grind the beans in a food mill or meat grinder.If neither appliance is available, process them in a food processor but only until the beans form a paste. (If blended too smoothly, the batter tends to fall apart during cooking.) Add the scallions, garlic, cilantro, cumin, baking powder, cayenne, salt, pepper, and coriander, if using.  Refrigerate for at least 30 minutes.",
    "Shape the bean mixture into 1-inch balls.Flatten slightly and coat with flour.",
    "Heat at least 1½-inches of oil over medium heat to 365 degrees.",
    "Fry the patties in batches, turning once, until golden brown on all sides, about 5 minutes.Remove with a wire mesh skimmer or slotted spoon. Serve as part of a meze or in pita bread with tomato-cucumber salad and tahina sauce."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/n3xxd91598732796.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb2"
  },
  "recipeName": "Rogaliki (Polish Croissant Cookies)",
  "recipeType": "Dessert",
  "recipeArea": "Polish",
  "ingredients": [
    "1 cup  Butter",
    "3 Egg Yolks",
    "8 oz  Cream Cheese",
    "1 tsp  Baking Powder",
    "3 cups  Flour",
    "1 Jar Jam"
  ],
  "instructions": [
    "In a medium bowl mix egg yolks, philly cheese and baking powder using a hand held mixer. Carefully start adding the flour. When the mixture will not be mixing well, and will look like wood chips, put away the blending mixer and using your hands knead the dough.",
    "Create a roll and cover in foil and freeze for 15 minutes. At this time preheat the oven to 375.",
    "Take the dough out and separate into two. Roll and cut out 3 inch trangles.",
    "Make as many as you can and on centre of each put a small spoon of jam. Roll them into a croissant shape.",
    "Place the croissants onto a greased cookie sheet, and bake for 10-12 minutes or until golden.",
    "Repeat with the rest of the dough.",
    "When you take them out, put aside and sprinkle with powdered sugar on top.",
    "This makes about 3 batches of 20 cookies each.",
    "Total count about 60 cookies."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/7mxnzz1593350801.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb3"
  },
  "recipeName": "Leblebi Soup",
  "recipeType": "Vegetarian",
  "recipeArea": "Tunisian",
  "ingredients": [
    "2 tbs Olive Oil",
    "1 medium finely diced Onion",
    "250g Chickpeas",
    "1.5L Vegetable Stock",
    "1 tsp  Cumin",
    "5 cloves Garlic",
    "1/2 tsp Salt",
    "1 tsp  Harissa Spice",
    "Pinch Pepper",
    "1/2  Lime"
  ],
  "instructions": [
    "Heat the oil in a large pot. Add the onion and cook until translucent.",
    "Drain the soaked chickpeas and add them to the pot together with the vegetable stock. Bring to the boil, then reduce the heat and cover. Simmer for 30 minutes.",
    "In the meantime toast the cumin in a small ungreased frying pan, then grind them in a mortar. Add the garlic and salt and pound to a fine paste.",
    "Add the paste and the harissa to the soup and simmer until the chickpeas are tender, about 30 minutes.",
    "Season to taste with salt, pepper and lemon juice and serve hot."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/x2fw9e1560460636.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb4"
  },
  "recipeName": "Crispy Eggplant",
  "recipeType": "Vegetarian",
  "recipeArea": "Filipino",
  "ingredients": [
    "1 large Egg Plants",
    "1 cup  Breadcrumbs",
    "50g Sesame Seed",
    "2 Eggs",
    "To taste Salt",
    "To taste Pepper",
    "For frying Vegetable Oil"
  ],
  "instructions": [
    "Slice eggplant into 1 cm (0.4-inch) slices. Place them in a bowl and sprinkle them with salt. allow them to sit for 30 minutes to render some of their liquid and bitterness.",
    "2. After 30 minutes wash eggplant slices from salt and pat dry with a kitchen towel.",
    "3. In a large bowl/plate place breadcrumbs and sesame seeds. In another bowl beat 2 eggs with pinch salt and pepper.",
    "4. Heal oil in a large skillet over high heat.",
    "5. Dip eggplant slices in egg, then in crumbs, and place in hot oil. Fry 2 to 3 minutes on each side, or until golden brown. Drain on a paper towel. "
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/c7lzrl1683208757.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb5"
  },
  "recipeName": "Massaman Beef curry",
  "recipeType": "Beef",
  "recipeArea": "Thai",
  "ingredients": [
    "85g Peanuts",
    "400ml can Coconut cream",
    "4 tbsp Massaman curry paste",
    "600g stewing cut into strips Beef",
    "450g waxy Potatoes",
    "1 cut thin wedges Onion",
    "4 leaves Lime",
    "1 Cinnamon stick",
    "1 tbsp Tamarind paste",
    "1 tbsp palm or soft light Brown sugar",
    "1 tbsp Fish Sauce",
    "1 red deseeded and finely sliced, to serve chilli",
    "to serve Jasmine Rice"
  ],
  "instructions": [
    "Heat oven to 200C/180C fan/gas 6, then roast the peanuts on a baking tray for 5 mins until golden brown. When cool enough to handle, roughly chop. Reduce oven to 180C/160C fan/gas 4.",
    "Heat 2 tbsp coconut cream in a large casserole dish with a lid. Add the curry paste and fry for 1 min, then stir in the beef and fry until well coated and sealed. Stir in the rest of the coconut with half a can of water, the potatoes, onion, lime leaves, cinnamon, tamarind, sugar, fish sauce and most of the peanuts. Bring to a simmer, then cover and cook for 2 hrs in the oven until the beef is tender.",
    "Sprinkle with sliced chilli and the remaining peanuts, then serve straight from the dish with jasmine rice."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/tvttqv1504640475.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb6"
  },
  "recipeName": "Chicken Karaage",
  "recipeType": "Chicken",
  "recipeArea": "Japanese",
  "ingredients": [
    "450 grams Boneless skin Chicken thigh",
    "1 tablespoon Ginger",
    "1 clove Garlic",
    "2 tablespoons Soy sauce",
    "1 tablespoon Sake",
    "2 teaspoon Granulated sugar",
    "1/3 cup Potato starch",
    "1/3 cup Vegetable oil",
    "1/3 cup Lemon"
  ],
  "instructions": [
    "Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.",
    "Add 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl",
    "Add a handful of chicken to the potato starch and toss to coat each piece evenly.",
    "Fry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it's a darker color after it's cooled off once. Serve with lemon wedges."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/tyywsw1505930373.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb7"
  },
  "recipeName": "Rosół (Polish Chicken Soup)",
  "recipeType": "Chicken",
  "recipeArea": "Polish",
  "ingredients": [
    "4 Chopped Chicken Legs",
    "2 large Onions",
    "5 chopped Carrots",
    "1 chopped Leek",
    "1 small Celery",
    "1/4  Cabbage",
    "1 whole Cloves",
    "1tsp Allspice",
    "2 Bay Leaf",
    "4 sprigs Parsley",
    "4 sprigs Dill",
    "1 tsp  Pepper",
    "1 tbs Salt"
  ],
  "instructions": [
    "Add chicken to a large Dutch oven or stock pot ",
    "Cover with water",
    "Bring to a boil and simmer for 2 to 2 1/2 hours, skimming any impurities off the top to insure a clear broth",
    "If your pot is big enough, add the vegetables and spices for the last hour of the cooking time",
    "My Dutch oven wasn’t big enough to hold everything, just the chicken and other bones filled the pot, so I cooked the meat/bones for the full cooking time, then removed them, and cooked the vegetables and spices separately",
    "Strain everything out of the broth",
    "Bone the chicken, pulling the meat into large chunks",
    "Slice the carrots",
    "Return the chicken and carrots to the broth",
    "Cook noodles according to package instructions if you’re using them",
    "Add noodles to bowl and then top with hot soup"
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/lx1kkj1593349302.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb8"
  },
  "recipeName": "Portuguese fish stew (Caldeirada de peixe)",
  "recipeType": "Seafood",
  "recipeArea": "Portuguese",
  "ingredients": [
    "2 finely chopped Onions",
    "1 Diced Red Pepper",
    "Small bunch Coriander",
    "1 small Red Chilli",
    "3 cloves Garlic",
    "400ml Dry White Wine",
    "Pinch Saffron",
    "1 Bay Leaf",
    "300g Potatoes",
    "400g Plum Tomatoes",
    "600g Cod",
    "300g Squid",
    "8 Tiger Prawns",
    "500g Clams",
    "500g Mussels",
    "1 sliced Baguette"
  ],
  "instructions": [
    "",
    "Heat a drizzle of oil in a large, deep-sided frying pan, and fry the onion and pepper on a medium heat until softened but not browned. Finely chop the coriander stalks (keep the leaves for later), and add to the pan with the chilli and chopped garlic. Fry for another few minutes. Add the wine, saffron and bay leaf and let it simmer until reduced by half.",
    "",
    "Add the potatoes, tomatoes, and 300ml water and bring to a gentle boil. Break up the tomatoes with a spoon on the side of the pan and simmer for 20-25 minutes until the potatoes are just tender, and the tomatoes have broken down.",
    "",
    "Season well, then gently push the fish into the sauce, and arrange the squid, prawns, clams and mussels on the surface. Put the lid on and cook for 6-8 minutes until the mussel and clam shells have opened, the prawns are cooked and the fish is flaky. Toast the bread, rub lightly with the halved garlic clove and drizzle with olive oil. Serve the stew scatted with chopped coriander leaves, and the toasts for dunking."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/do7zps1614349775.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febb9"
  },
  "recipeName": "Matar Paneer",
  "recipeType": "Vegetarian",
  "recipeArea": "Indian",
  "ingredients": [
    "1 tbls Sunflower Oil",
    "225g Paneer",
    "2 Ginger",
    "1 tsp  Cumin",
    "1 tsp  Turmeric",
    "1 tsp  Coriander",
    "1 Green Chilli",
    "4 large Tomato",
    "150g Peas",
    "1 tsp  Garam Masala",
    "Small bunch Coriander",
    "to serve Naan Bread"
  ],
  "instructions": [
    "Heat the oil in a frying pan over high heat until it’s shimmering hot. Add the paneer, then turn the heat down a little. Fry until it starts to brown at the edges, then turn it over and brown on each side – the paneer will brown faster than you think, so don’t walk away. Remove the paneer from the pan and drain on kitchen paper.",
    "Put the ginger, cumin, turmeric, ground coriander and chilli in the pan, and fry everything for 1 min. Add the tomatoes, mashing them with the back of a spoon and simmer everything for 5 mins until the sauce smells fragrant. Add a splash of water if it’s too thick. Season well. Add the peas and simmer for a further 2 mins, then stir in the paneer and sprinkle over the garam masala. Divide between two bowls, top with coriander leaves and serve with naan bread, roti or rice."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/xxpqsy1511452222.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febba"
  },
  "recipeName": "Stuffed Bell Peppers with Quinoa and Black Beans",
  "recipeType": "Vegetarian",
  "recipeArea": "Mexican",
  "ingredients": [
    "4 whole Green Pepper",
    "1 tablespoon Olive Oil",
    "1 small finely diced Onion",
    "2 cloves minced Garlic",
    "1 cups Quinoa",
    "1 can  Black Beans",
    "1 cup  Sweetcorn",
    "1 can  Diced Tomatoes",
    "1 teaspoon Cumin",
    "½ tsp Chili Powder",
    "½ tsp Smoked Paprika",
    "To taste Salt",
    "To taste Pepper",
    "1 1/2 cup  Shredded Mexican Cheese",
    "Chopped Cilantro"
  ],
  "instructions": [
    "1. Preheat your oven to 375°F (190°C). Lightly grease a 9x13-inch baking dish or a similar-sized casserole dish.",
    "2. Place the bell pepper halves in the prepared baking dish, cut side up. Bake for 15-20 minutes, or until slightly softened.",
    "3. While the bell peppers are baking, prepare the filling. In a large skillet, heat the olive oil over medium heat. Add the chopped onion, and cook for 3-4 minutes, until softened. Add the garlic, and cook for another 1 minute, until fragrant.",
    "4. Stir in the cooked quinoa, black beans, corn, diced tomatoes, ground cumin, chili powder, smoked paprika, salt, and pepper. Cook for 5-7 minutes, until heated through. Remove the skillet from heat, and stir in 1 cup of the shredded cheese, if using.",
    "5. Remove the bell peppers from the oven, and carefully stuff each pepper half with the quinoa and black bean mixture. Top the stuffed peppers with the remaining 1/2 cup of shredded cheese, if using.",
    "6. Return the stuffed peppers to the oven, and bake for another 15-20 minutes, until the cheese is melted and the peppers are tender.",
    "7. Remove from the oven, and allow the stuffed peppers to cool for 5 minutes before serving. Garnish with fresh chopped cilantro."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/b66myb1683207208.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febbb"
  },
  "recipeName": "Lamb tomato and sweet spices",
  "recipeType": "Lamb",
  "recipeArea": "Moroccan",
  "ingredients": [
    "2 tbsp olive oil",
    "4cm piece finely chopped ginger",
    "2 cloves peeled and chopped garlic",
    "800g peeled and chopped  tomatoes",
    "2 tbsp lemon juice",
    "1 tsp caster sugar",
    "50 vine leaves",
    "1 large fennel bulb",
    "400g lamb mince",
    "1 medium onion",
    "1 small peeled and coarsely grated potato",
    "2 tbsp basmati rice",
    "2 tbsp chopped parsley",
    "2 tbsp chopped coriander",
    "1 tbsp lemon juice",
    "2 cloves garlic",
    "½ tsp ground clove",
    "½ tsp ground  cinnamon",
    "2 medium tomatoes"
  ],
  "instructions": [
    "Use pickled vine leaves here, preserved in brine. Small delicate leaves are better than the large bristly ones but, if only large leaves are to hand, then trim them to roughly 12 by 12 cms so that you don't get too many layers of leaves around the filling. And remove any stalks. Drain the preserved leaves, immerse them in boiling water for 10 minutes and then leave to dry on a tea towel before use. ",
    "Basmati rice with butter and pine nuts is an ideal accompaniment. Couscous is great, too. Serves four.",
    "First make the filling. Put all the ingredients, apart from the tomatoes, in a bowl. Cut the tomatoes in half, coarsely grate into the bowl and discard the skins. Add half a teaspoon of salt and some black pepper, and stir. Leave on the side, or in the fridge, for up to a day. Before using, gently squeeze with your hands and drain away any juices that come out.",
    "To make the sauce, heat the oil in a medium pan. Add the ginger and garlic, cook for a minute or two, taking care not to burn them, then add the tomato, lemon juice and sugar. Season, and simmer for 20 minutes.",
    "While the sauce is bubbling away, prepare the vine leaves. Use any torn or broken leaves to line the base of a wide, heavy saucepan. Trim any leaves from the fennel, cut it vertically into 0.5cm-thick slices and spread over the base of the pan to cover completely.",
    "Lay a prepared vine leaf (see intro) on a work surface, veiny side up. Put two teaspoons of filling at the base of the leaf in a 2cm-long by 1cm-wide strip. Fold the sides of the leaf over the filling, then roll it tightly from bottom to top, in a cigar shape. Place in the pan, seam down, and repeat with the remaining leaves, placing them tightly next to each other in lines or circles (in two layers if necessary).",
    "Pour the sauce over the leaves (and, if needed, add water just to cover). Place a plate on top, to weigh the leaves down, then cover with a lid. Bring to a boil, reduce the heat and cook on a bare simmer for 70 minutes. Most of the liquid should evaporate. Remove from the heat, and leave to cool a little - they are best served warm. When serving, bring to the table in the pan - it looks great. Serve a few vine leaves and fennel slices with warm rice. Spoon the braising juices on top and garnish with coriander."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/qtwtss1468572261.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febbc"
  },
  "recipeName": "Cashew Ghoriba Biscuits",
  "recipeType": "Dessert",
  "recipeArea": "Tunisian",
  "ingredients": [
    "250g Cashew Nuts",
    "100g  Icing Sugar",
    "2 Egg Yolks",
    "2 tbs Orange Blossom Water",
    "To Glaze Icing Sugar",
    "100g  Almonds"
  ],
  "instructions": [
    "Preheat the oven at 180 C / Gas 4. Line a baking tray with greaseproof paper.",
    "In a bowl, mix the cashews and icing sugar. Add the egg yolks and orange blossom water and mix to a smooth homogeneous paste.",
    "Take lumps of the cashew paste and shape into small balls. Roll the balls in icing sugar and transfer to the baking tray. Push an almond in the centre of each ghribia.",
    "Bake until the biscuits are lightly golden, about 20 minutes. Keep an eye on them, they burn quickly."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/t3r3ka1560461972.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febbd"
  },
  "recipeName": "Oxtail with broad beans",
  "recipeType": "Beef",
  "recipeArea": "Jamaican",
  "ingredients": [
    "450g Oxtail",
    "1 chopped Onion",
    "1 Spring Onions",
    "2 cloves minced Garlic",
    "1 tsp  Ginger",
    "1 chopped Scotch Bonnet",
    "2 tbs Soy Sauce",
    "1 chopped Fresh Thyme",
    "2 tbs Vegetable Oil",
    "350ml Water",
    "200g Broad Beans",
    "1 tbs Corn Flour",
    "2 tbs Water"
  ],
  "instructions": [
    "Toss the oxtail with the onion, spring onion, garlic, ginger, chilli, soy sauce, thyme, salt and pepper. Heat the vegetable oil in a large frying pan over medium-high heat. Brown the oxtail in the pan until browned all over, about 10 minutes. Place into a pressure cooker, and pour in 375ml water. Cook at pressure for 25 minutes, then remove from heat, and remove the lid according to manufacturer's directions.",
    "Add the broad beans and pimento berries, and bring to a simmer over medium-high heat. Dissolve the cornflour in 2 tablespoons water, and stir into the simmering oxtail. Cook and stir a few minutes until the sauce has thickened, and the broad beans are tender."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/1520083578.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663a56b1d21225a2e60febbe"
  },
  "recipeName": "Tunisian Orange Cake",
  "recipeType": "Dessert",
  "recipeArea": "Tunisian",
  "ingredients": [
    "1 large Orange",
    "300g Caster Sugar",
    "75 ml  Olive Oil",
    "280g Flour",
    "1 tbs Baking Powder",
    "4 large Eggs",
    "2 tsp Vanilla Extract"
  ],
  "instructions": [
    "Preheat oven to 190 C / Gas 5. Grease a 23cm round springform tin.",
    "Cut off the hard bits from the top and bottom of the orange. Slice the orange and remove all seeds. Puree the orange with its peel in a food processor. Add one third of the sugar and the olive oil and continue to mix until well combined.",
    "Sieve together flour and baking powder.",
    "Beat the eggs and the remaining sugar with an electric hand mixer for at least five minutes until very fluffy. Fold in half of the flour mixture, then the orange and the vanilla, then fold in the remaining flour. Mix well but not for too long.",
    "Pour cake mixture into prepared tin and smooth out. Bake in preheated oven for 20 minutes. Reduce the oven temperature to 160 C / Gas 2 and bake again for 30 minutes Bake until the cake is golden brown and a skewer comes out clean. Cool on a wire cake rack."
  ],
  "thumbnail": "https://www.themealdb.com/images/media/meals/y4jpgq1560459207.jpg",
  "__v": 0
},
{
  "_id": {
    "$oid": "663b84f340bacceb145f2986"
  },
  "recipeName": "Masala Dosa",
  "recipeType": "Breakfast",
  "recipeArea": "Indian",
  "thumbnail": "https://www.cookwithmanali.com/wp-content/uploads/2020/05/Masala-Dosa-768x1164.jpg",
  "ingredients": [
    "2 cups rice",
    "1 cup urad dal",
    "1/2 tsp fenugreek seeds",
    "Salt to taste",
    "Oil for cooking",
    "2 medium potatoes",
    "1 onion",
    "1 green chili",
    "1 tsp mustard seeds",
    "1/2 tsp turmeric powder",
    "1/2 tsp chili powder",
    "Curry leaves"
  ],
  "instructions": [
    "Rinse rice and urad dal separately.",
    "Soak rice and urad dal in water for 6-8 hours.",
    "Grind rice and urad dal separately, then mix together with salt.",
    "Allow the batter to ferment overnight.",
    "To make dosa, heat a skillet and pour a ladle of batter, spreading it thin.",
    "Drizzle a few drops of oil and cook until golden brown.",
    "For the filling, boil and mash potatoes.",
    "In a pan, sauté mustard seeds, curry leaves, onions, and green chili.",
    "Add mashed potatoes, turmeric, and chili powder.",
    "Cook for 5-7 minutes and set aside.",
    "Place a spoonful of filling on the dosa, roll it, and serve with chutney."
  ]
},
{
  "_id": {
    "$oid": "663b84f340bacceb145f2987"
  },
  "recipeName": "Idly",
  "recipeType": "Breakfast",
  "recipeArea": "Indian",
  "thumbnail": "https://t3.ftcdn.net/jpg/01/42/70/66/240_F_142706641_pDs13MNNEkoP8fmLkqmbFf7rnEq1zNwe.jpg",
  "ingredients": [
    "2 cups rice",
    "1 cup urad dal",
    "Salt to taste",
    "Oil for greasing"
  ],
  "instructions": [
    "Rinse rice and urad dal separately.",
    "Soak rice and urad dal in water for 6-8 hours.",
    "Grind rice and urad dal separately, then mix together with salt.",
    "Allow the batter to ferment overnight.",
    "Grease idly molds with oil.",
    "Fill the molds with batter and steam for 10-12 minutes.",
    "Remove from the molds and serve with chutney and sambar."
  ]
},
{
  "_id": {
    "$oid": "663b84f340bacceb145f2988"
  },
  "recipeName": "Butter Chicken",
  "recipeType": "Main Course",
  "recipeArea": "Indian",
  "thumbnail": "https://t3.ftcdn.net/jpg/02/29/39/34/240_F_229393457_LGaJHVGBn04k84lX5tuJ9bi1FQhffUxq.jpg",
  "ingredients": [
    "500g chicken",
    "2 tbsp butter",
    "1 cup cream",
    "1 cup tomato puree",
    "1 onion, finely chopped",
    "2 cloves garlic, minced",
    "1 inch ginger, grated",
    "1 tsp cumin powder",
    "1 tsp garam masala",
    "1 tsp chili powder",
    "Salt to taste"
  ],
  "instructions": [
    "Marinate chicken with yogurt, ginger, and garlic for at least 2 hours.",
    "In a pan, melt butter and sauté onions until golden brown.",
    "Add garlic and ginger, cook until fragrant.",
    "Add tomato puree, cumin powder, chili powder, and garam masala.",
    "Cook for 10 minutes, then add marinated chicken.",
    "Cook until chicken is tender, then add cream.",
    "Simmer for another 10 minutes, then serve with rice or naan."
  ]
},
{
  "_id": {
    "$oid": "663b84f340bacceb145f2989"
  },
  "recipeName": "Biriyani",
  "recipeType": "Main Course",
  "recipeArea": "Indian",
  "thumbnail": "https://t4.ftcdn.net/jpg/04/90/19/23/240_F_490192375_qg0In7Wbt4dh5zx18yEazvzPYydN2YOO.jpg",
  "ingredients": [
    "500g basmati rice",
    "500g chicken or lamb",
    "2 onions, sliced",
    "2 tomatoes, chopped",
    "2 tbsp biriyani masala",
    "1 cup yogurt",
    "1 inch ginger, grated",
    "2 cloves garlic, minced",
    "1/2 tsp saffron",
    "2 tbsp ghee",
    "1/2 cup coriander leaves"
  ],
  "instructions": [
    "Wash and soak basmati rice for 30 minutes.",
    "Marinate chicken or lamb with yogurt, biriyani masala, ginger, and garlic.",
    "Fry onions in ghee until golden brown, then remove half for garnish.",
    "Add marinated meat and cook until tender.",
    "Add chopped tomatoes and cook until soft.",
    "Boil rice with saffron and cook until almost done.",
    "Layer rice and meat in a large pot, with rice on top.",
    "Sprinkle fried onions and coriander leaves on top.",
    "Cover and cook on low heat for 20-30 minutes.",
    "Serve hot with raita or salad."
  ]
},
{
  "_id": {
    "$oid": "663b84f340bacceb145f298a"
  },
  "recipeName": "Parotta",
  "recipeType": "Bread",
  "recipeArea": "Indian",
  "thumbnail": "https://t3.ftcdn.net/jpg/05/15/68/32/240_F_515683261_df9lrDahFzDyCgqxkKsaXLcENjIiVHiy.jpg",
  "ingredients": [
    "500g all-purpose flour (maida)",
    "2 tbsp oil",
    "1 tsp salt",
    "Water to knead",
    "Oil for cooking"
  ],
  "instructions": [
    "Mix flour and salt in a bowl.",
    "Add oil and water, knead into a soft dough.",
    "Cover the dough and let it rest for 30 minutes.",
    "Divide the dough into equal balls.",
    "Roll out each ball into a thin circle.",
    "Fold it into a long strip and roll it into a coil.",
    "Flatten the coil into a circle.",
    "Cook on a hot griddle with oil until golden brown on both sides.",
    "Serve hot with curry or chutney."
  ]
},
{
  "_id": {
    "$oid": "663b84f340bacceb145f298b"
  },
  "recipeName": "Pav Bhaji",
  "recipeType": "Snack",
  "recipeArea": "Indian",
  "thumbnail": "https://t3.ftcdn.net/jpg/06/28/76/46/240_F_628764658_g76YPBt4VwWnGz8jyODGQgAMoPIDoXZK.jpg",
  "ingredients": [
    "4 potatoes, boiled and mashed",
    "1 cup green peas",
    "2 onions, chopped",
    "2 tomatoes, chopped",
    "1 bell pepper, chopped",
    "1 tbsp pav bhaji masala",
    "2 tbsp butter",
    "Salt to taste",
    "8 pav buns",
    "Lemon wedges and chopped coriander for garnish"
  ],
  "instructions": [
    "In a pan, melt butter and sauté onions until golden brown.",
    "Add tomatoes and bell pepper, cook until soft.",
    "Add pav bhaji masala and mashed potatoes, mix well.",
    "Add green peas and cook for 10 minutes.",
    "Serve with pav buns, toasted with butter.",
    "Garnish with lemon wedges and chopped coriander."
  ]
}]